{
  "id": "1pw2f4e",
  "subreddit": "tifu",
  "title": "TIFU I asked to see my fiancés nans holiday photos from when she was younger",
  "body": "I’ll keep it short and sweet, it’s Christmas, we’re all sat round the table and my Mrs talks about how her nan used to globe trot very often and never really stayed in one place, I said “oh wow I’d love to see the photos” the man responds “I keep them in my bedroom come on I’ll show you them” me excited to see all the sights she has seen in her life. All very innocent we sit down on her bed as she gets out her shoe box she starts to regale her years on cruises and many people she has met, she then starts telling me about blokes she has been with, me being me I let her continue with a few chuckles and letting her continue.\n\n\nStarting to feel uncomfortable, sat on her bed, with her sat so close to me, I try and speed it up to see these photos. There’s loads in there and she has seen most of the world so I turn the conversation back to the photos trying to talk about the wild animals she’s seen, the wonders of all the incredible countries, as the photos go on she starts pointing out men in them and going, “he was such a good lover, this one had a partner, this one said he would follow me round the world”.\n\nThen we get to the beach photos and the horror on my face when she pulled out nude fucking photos of her on a beach from when she was around 30-40 and she simply asks “what do you think”, to which I sat there stunned and simply said “oh wow, well uhm all these places look amazing but I think we should go back down it’s been a while. \n\nChristmas dinner was very awkward \n\nTLDR my fiancés nan showed me nudes \n\n",
  "author": "throw-away2257",
  "score": 3140,
  "url": "https://reddit.com/r/tifu/comments/1pw2f4e/tifu_i_asked_to_see_my_fiancés_nans_holiday/",
  "created_utc": "2025-12-26 12:43:35",
  "num_comments": 287
}