{
  "id": "1pwchxe",
  "subreddit": "confession",
  "title": "I completely cut off contact with my brother and wound up skipping Xmas.",
  "body": "I told my family I was at an NBA game for Christmas, I actually stayed home with my dogs.\n\nSo my brother caused a scene to say the least at thanksgiving. He has always been a problem. I think he is bipolar without proper health care. It’s hard to watch. He’s 34-35. He is 4 years older than I am and his whole life has just been a problem. He had learning disabilities, he would drive his car literaly 80-90 mph on the way to school in the morning and the car would reek of marijuana. He would threaten me that if I ever told he would make my life a living hell, he already was such a problem at the house i didn’t want him to focus it on me.\n\nFor last 4-5 years he has been fixated on our relationship, how he wants to fix it. I’m nice to him, I talk to him at get togethers. And in his mind this thanksgiving I was “on his team” I studied a bunch of videos on how to deal with highly insecure people before thanksgiving. The smallest thing will set him off and he picks on me. I’m 30 years old. So this thanksgiving every time he tried I shut it down and barely talked the entire get together. He ended up threatening my two younger cousins for literally no reason. In his mind they disrespected him, they left. I left. He apparently stood up on a couch because he thought my uncle said something about him. He didn’t. \n\nMy aunt sent our side of the family basically ***** is not allowed to be anywhere near our cousins again. And I have tried to explain to my family this has been happening to me for a long time. They know, but they don’t know what to do. So I took the opportunity to say look I’m not doing anything if he’s there either. My aunt was so upset about what he did that she contacted my nana. My nana knows about it and was crying convinced him to change. All this shit. \n\nThen I get invited over to Christmas with him his wife my sister and my niece. I said look you know I don’t feel comfortable around him he’s bipolar he doesn’t take medication, you witnessed what he did on thanksgiving, and the only reason that was t directed towards me is because of the how to deal with mental health videos I watched. They didn’t listen to me or thought I was bluffing.\n\nI noticed a NBA team was playing this year on Christmas Day. I told everyone in my family I was going to the game. I did not. I stayed home and watched Christmas movies, stress free for the first holiday in literally 5 years. \n\nI will not see or have contact with ***** for hopefully many many years. ",
  "author": "BeerStein_Collector",
  "score": 437,
  "url": "https://reddit.com/r/confession/comments/1pwchxe/i_completely_cut_off_contact_with_my_brother_and/",
  "created_utc": "2025-12-26 20:20:29",
  "num_comments": 50
}