{
  "id": "1pwi5ma",
  "subreddit": "relationships",
  "title": "I feel like my marriage is doomed",
  "body": "My (30F) husband (30M) and I are not doing well. We’ve been together 8 years (married for one now), had our first baby now almost 17 months ago, and we have had sex once. One time. In now two years (since conception until now.) And I have had conversations with him about how it makes me feel, how I want things to change, how I just want a little bit of effort. Nothing has changed in these two years, and it’s all came to a head finally and I just lost it on him.\n\nBut it’s not just that. When our daughter was born, she was premature (33.5 weeks) and in the NICU for two weeks. I didn’t want visitors since I had had severe preeclampsia, but my in-laws came to see me after I was transferred to mother/baby, and essentially forced their way into the NICU to see her. So when I made the decision that we would be the only ones who visited her while she was in the NICU—and her neonatologist even agreed with that—I was called manipulative by my father in law. My husband told me that the night after he called me that. And now I have found out that they’ve also been calling me vindictive, that I have been “keeping their grandchild away from them” because they decide to show up unannounced at our house and then feel “rushed to leave”, and a few other things… and when I told my husband that I wanted him to stand up for me and OUR child, he told me that he thought his parents and I needed to have a conversation and that he “couldn’t play mediator.” I have many instances of him not defending me or showing up for me emotionally (the biggest being when my dad died and he didn’t come until the next day to see me… but only after playing tennis with his best friend, and then offered the excuse of “not wanting to believe it was real.”)\n\nSo between all of this, the lack of intimacy in now \\*\\*YEARS\\*\\*, and feeling more like a roommate who co-parents with him, I feel like I cannot save my marriage at this point. I’m going to a marital issue specialized counselor, and also told him that, but I don’t know anymore. It feels like my conversations are being thrown at a wall. And I get it, truly, that intimacy is hard with a baby. Especially when they get older, \\*especially\\* when you don’t have childcare options. But I don’t feel like it should be like this.\n\nAlso, I know that I can initiate things. But it’s also a principle of wanting to feel wanted by my spouse. And I have tried sending him like flirty/suggestive texts, but I always get “😂😂😂” in response, like it’s a joke. Also, in the vane of defending me, he told me that he hadn’t because he hadn’t ever had to defend his exes before. HA! That one stung a little, even though I’m his longest relationship, wife, and mother of his child. He also told me that he was “so focused on earning money and keeping us surviving financially” while I’m finishing my nursing bridge program in his defense to all of this, but I don’t know how much that would matter if our marriage doesn’t survive.\n\nLong winded text surmised, is this relationship salvageable, or is it something that is just slow-burn crashing?\n\nTL;DR: husband and I are in a stalled marriage after having our child, and are approaching two years of no intimate contact with zero resolution when issues are brought up.",
  "author": "meek0ne_",
  "score": 135,
  "url": "https://reddit.com/r/relationships/comments/1pwi5ma/i_feel_like_my_marriage_is_doomed/",
  "created_utc": "2025-12-27 00:20:27",
  "num_comments": 48
}