{
  "id": "1pwpv12",
  "subreddit": "tifu",
  "title": "TIFU by jokingly ringing up a tranasaction for $28 million at work",
  "body": "I work at a liquor store, and it being the 26th of December, it was relatively very slow today. Near the end of my shift, me and a coworker had nothing much to do, so I jokingly scanned a miniature bottle of alcohol several times as if he was a customer purchasing that many bottles.\n\nTo keep the joke going, I then scanned an entire box of pre-made shooters (something like 40 shooters at $3 each), several times once again. The total was something like $2,500 at this point.\n\nMy coworker then has the bright idea to check the system and find some expensive wines that were sold and are still in the system, and finds one worth several thousands of dollars (almost $10k), and sets the quantity in the POS to 999 (the maximum allowed). By this point, the running total is \\~***$9 MILLION***, and we’re cracking up (we were extremely bored). He then finds ANOTHER bottle, this one nearly $20k, and sets the quantity to 999, bringing the total up to \\~***$28 MILLION***.\n\nNow, this is where I’m personally responsible for the fuck up; I pretended to bring the transaction up to the point right up to when you confirm how much the customer is paying in cash (it automatically assumes the customer is paying in full, and the only thing stopping the transaction from going through was single press of the “Enter” key).\n\nMy coworker didn’t see that I was already there, and mistakenly pressed “Enter” to reach the same point I had brought us to.\n\n$28,000,000 in theoretical cash made its way into the cash register’s balance.\n\nI yelled at my coworker to ask WTF he did and he realized what he had done and his eyes went wide.\n\nWe immediately tried to reverse the entire transaction, but (understandably), there’s a $1 million maximum that you can return at a time, so attempting to return $28,000,000 of “sold” alcohol didn’t work. After figuring out the maximum, I then had to do dozens of returns each worth $1 million at a time until every single bottle of alcohol was “returned”, and the inventory was corrected from -999 to 0.\n\nHowever, in the reports for that day, it’ll show $28 million in revenue and a similar amount in returns, which will completely fuck up stats and graphs and everything, which higher-ups will obviously inquire about.\n\nI’m going to go wait for my store manager tomorrow morning before she comes in so that I can explain what happened and confess that we were joking around and never meant to go through with the transaction. Please pray for me and my job (I 100% accept that we are at fault and deserve some sort of punishment for exaggerating as much as we did, and for not working when we were supposed to).\n\nTL;DR: Me and my coworker pretended to ring up a $28 million transaction as a joke, and then accidentally went through with it, fucking up the store’s stats for that day even if we managed to “return” the products in the system.\n\nUpdate: My boss was understandably frustrated and disappointed but the worst that can happen is the higher ups will meet and they’ll probably decide to give us warnings/it’ll be in our files, but nothing more.",
  "author": "JediJacob04",
  "score": 10341,
  "url": "https://reddit.com/r/tifu/comments/1pwpv12/tifu_by_jokingly_ringing_up_a_tranasaction_for_28/",
  "created_utc": "2025-12-27 06:30:10",
  "num_comments": 667
}