{
  "id": "1px7o77",
  "subreddit": "tifu",
  "title": "TIFU by having my appendix taken out on Xmas eve",
  "body": "Tldr had my appendix taken out Xmas eve, now I have to eat flight costs on travel plans that are canceled. \n\nSo this week has been super eventful! Tuesday I wasn't feeling particularly well. Body felt a bit off. Bad headache all day and a stomach pain that persisted through pain meds. Around 10pm I broke out in a 102 fever, chills, sweats, and overall fatigue. My wife and I thinking I just have a bad stomach bug decide I'll take some Tylenol for the fever and sleep it off! \n\nWake up the next morning around 4am just doubled over in pain. It's Xmas eve though and I'm thinking I just need to get through the morning and I'll be fine! This will pass! By 10am though it wasn't letting up. I was dry heaving and constantly in pain! So off to the ER! \n\nWe check in at 11:45 and after loads of waiting and tests and waiting and scans and meds, they tell me my appendix is inflamed and the surgeon will need to open me up like a kid opening a gift Xmas morning. Great!!! \n\nI go in surgery at 6 and come alive at around 7:30/8 I'm unsure about that part, and chat with the staff about football for around 10 minutes before they kick me out and I'm back home by 8:30 (9 hrs in the ER). \n\nNow I'm home recovering having missed Xmas eve with my immediate family and had a little time with the wife's family for Xmas which was nice. But I'm on lots of restrictions like lifting anything over 5 lbs, which means I can't help out with a lot of chores around the house, help with the baby, put away Xmas decorations…etc. But the worst part? The worst part of all of this? I had plans to visit my brother (who we haven't seen in 7 or 8 years) for the new year in Pennsylvania (I'm in California). \n\nWe were going to spend a week out there so he could meet his new niece. Now I have to cancel our flight plans and here's where the fuck up actually hurts me…southwest doesn't refund basic fare. They give you flight credit dated to expire 6 mos from purchase date. We bought these flights months ago, so now we have until March to use the flight credits or we lose them entirely!! \n\nSo now having my appendix ejected cost me Xmas eve with my family and over $1400 in canceled flights. Oh and a $100 car rental cancellation fee. Merry Xmas everyone!",
  "author": "Luke_starkiller34",
  "score": 100,
  "url": "https://reddit.com/r/tifu/comments/1px7o77/tifu_by_having_my_appendix_taken_out_on_xmas_eve/",
  "created_utc": "2025-12-27 21:26:13",
  "num_comments": 59
}