{
  "id": "1px90p2",
  "subreddit": "tifu",
  "title": "TIFU by trying waxplay around my cat",
  "body": "First - this is honestly not as salacious as the title makes it sound.  \nSecond - this was actually on Christmas day, and not today.\n\nWell, after smoking a whole lot of tannen Baum i asked my SO if they'd like to try waxplay.  I'd had the candles for a while and just sort of forgot about them.  Not sure what made me remember them that day - possibly just the Christmas season. \n\nHe eagerly agreed, i threw down a towel, then we discussed which side of the burger was getting flame broiled.  I (very foolishly) offered up my stomach to start.  The candle is lit. The anticipation is rising. I'm giggling remembering fondly how nice it felt to dip my fingers in candle wax as a kid.  \n\n\"Here it comes!\" ... i hear, and then WHA-BAM!! What feels more like a cinder lands on my skin. I let out an involuntary yelp, SO immediately blows out the candle, and i launch into apology mode.  I can hear him nervously laughing and i assume it's about my reaction. \n\nNope.\n\nI look up at him and my SO is still laughing, but staring at the bedroom doorway.  I turn - and there he is. My giant orange chonk of a cat.  The senior citizen who sleeps 16 hours a day, screams for wet food, and is scared of his own shadow.  The cat that hides from the vacuum. The cat that once got scared when i changed my top because he didn't recognize me...  \n\nJust standing there, menacingly, and staring down my SO.  Bro wasn't even on the same floor when i screeched. This one-braincelled cheeto must have gone charging up the stairs and to my doorway in less than 3 seconds. \n\nAfter MANY reassuring words to him, the cat eventually waddled off. Sexytime got significantly delayed, and I have learned that if i'm going to dip my toe into zesty sleep again, i need to keep the door shut or risk my cat severely misreading the situation again and going ham on my man. \n\nTL;DR:  Don't make painful zesty sounds around your orange tom. He'll assume you're being attacked, rush to see the hullabaloo and you'll spend the next 10 mins trying to DBT your cat. ",
  "author": "WashawayWashbear",
  "score": 2132,
  "url": "https://reddit.com/r/tifu/comments/1px90p2/tifu_by_trying_waxplay_around_my_cat/",
  "created_utc": "2025-12-27 22:24:07",
  "num_comments": 66
}