{
  "id": "1pxhobs",
  "subreddit": "tifu",
  "title": "TIFU by asking my boyfriend what was really wrong with his mental state",
  "body": "This is going to be long, so sorry in advanced. I, F(23) have been with my boyfriend M(24) for 1.5 years. We are long distance between two European countries but see each other once or twice a month and for long periods over the summer and university breaks and it’s very manageable. We’re both studying our masters and we’re busy enough so it feels fine. I am going to move to his country in 2 years when I finish. \n\nFor the first year of our relationship things were so good. The sex was great, passion was amazing and I was so certain I had found my person and was making plans to spend the rest of my life with him. In the last 6 months, he’s been increasingly less interested in sex, but still very lovey dovey, so I was confused. I know it’s not physical, cause I’ll be honest, I look great naked and anyone with eyes and who is attracted to women would agree, so I honestly didn’t know what was happening. \n\nHe eventually opened up that his mental health wasn’t the best but he wasn’t ready to talk so I gave him time and didn’t press it, but just before christmas whilst I was staying with him I pressed a little more and got some of why he’s been feeling bad. \n\nHe says that he loves me so much and doesn’t think he could do better than me, but he worries that he’s trapped and that he’s spending his youth in a committed relationship whilst he’s never travelled or anything by himself. He also wants to do Erasmus (study abroad) and isn’t sure he wants to do this in a relationship. He is adamant that he genuinely wants to spend his life with me, hence why he feels so bad about feeling this way, but just wanted to tell me where his head is at. \n\nWhen I pressed him more later that night, he also told me that whilst he was clubbing, a girl asked if he wanted to make out with him and he said no and went home, but he only went home because he was very tempted and wanted to say yes. \n\nOther than all this, I know his mental health is very bad and he’s quite fragile, so I feel like I can’t even respond in any normal way without putting him at risk of harming himself, but also, we don’t have sex, the passion is gone, the love is so strong but I am just not happy and I feel like an idiot for staying with him and planning my whole life around moving to his home country and learning his language. \n\nI told him I will give him time to talk to his psychologist and figure it out because I don’t want to abandon him over overthinking, but I don’t know how long I’m supposed to put up with being so sincerely unfulfilled. \n\nOther than this he is an INCREDIBLE boyfriend and is so so so kind, loving and supportive and he is my absolute world, I never want to know another person as minutely as I know him, I’m so comfortable with him. That’s why this is so awful. \n\nAny advice is appreciated :/. \n\nTL;DR: I messed up by asking my boyfriend what was really wrong with him and found out he’s not even sure he wants to be in a relationship and whilst he wouldn’t cheat on me, he feels very tempted when offered. Don’t know if I should bother staying. \n\nEdit: ok maybe ‘I know I can’t do better the. You’ sounds suuuper douchey but what he meant was that he is unsure he’ll ever meet and get into a relationship with someone he loves and values as much. \nAlso the sex thing is complicated and I told him he needs to go to therapy about it asap because it’s extremely detrimental 😪😪\n\nSecond edit: ok I have to add as well he has depression, had it before we met and he had been single for 2 years, and he sees a therapist. It was manageable when we met but has been slowly getting worse for 6 months. This is a small factor to him feeling like shit but he is depressed for other unknown reasons that have nothing to do with me",
  "author": "get-cucked1",
  "score": 524,
  "url": "https://reddit.com/r/tifu/comments/1pxhobs/tifu_by_asking_my_boyfriend_what_was_really_wrong/",
  "created_utc": "2025-12-28 05:04:17",
  "num_comments": 170
}