{
  "id": "1pxiuha",
  "subreddit": "relationships",
  "title": "I'm shocked and livid",
  "body": "I (23F) and my bf have been dating for three years, and I’m ready to throw it all away after our most recent call. I just got home from grad school for my winter break. I drove over three days home (live on the opposite side of the country) and returned home jobless, to parents who should be divorced but aren’t, toxic family members, and health concerns for my grandparents. After being home for two days, I had to rush down to my grandparents' house (4 hrs away) because both grandparents are in the hospital and dying. I’ve been living in their house for over a week, taking care of everything, figuring out their health, organizing and cleaning their home, basically nonstop moving. Did not get to celebrate any Christmas and just prepared for my grandparents. My grandfather came home yesterday in somewhat good health. He has two different kinds of cancer that have spread to his lungs, and he will eventually die from them. My grandmother, on the other hand, is dying, can’t eat or drink, and just arrived via ambulance at her house for hospice care. I said goodbye to her and then drove 4 hours back home while my parents stayed back. My bf and I haven’t had time to talk much since I’ve been so busy, so our first FaceTime where we could talk was tonight, as soon as I got home. Does he offer any words of condolences over the phone? No. Instead, he rolls a joint and smokes it while asking how I’m doing! We live on opposite sides of the country and met at college. I don’t know how to end things. I don’t want to fly out there to end things, and I’m not sure how to do it over the phone. I’m tired of dealing with his immaturity and know that my future husband would not do what he just did! Any advice?\n\nTL;DR:\n\nMy bf did not comfort me over FaceTime after I said goodbye to my dying grandmother. Instead, he rolled a joint and then proceeded to smoke it, without giving me any comfort about the things I'm going through.\n\nQuestions:\n\n• Am I overreacting?\n\n• How do you end things if you don't want to fly out to do it?",
  "author": "Fit_Description9183",
  "score": 254,
  "url": "https://reddit.com/r/relationships/comments/1pxiuha/im_shocked_and_livid/",
  "created_utc": "2025-12-28 06:03:44",
  "num_comments": 46
}