{
  "id": "1pxj074",
  "subreddit": "tifu",
  "title": "TIFU English isn’t our first language and this went horribly wrong",
  "body": "Me and my friend were standing near a mini market when a guy pulled up in a fancy car (a Mercedes, though I don’t know the exact model). My friend said that when the guy finished shopping, he would approach him and ask if he could give us a ride.\n\nWhen the guy came back to his car, my friend walked up to him and literally said:\n\n“Could you do us a favor, can you ride us in your car?”\n\nI started laughing so hard I couldn’t stop. To me, it sounded like my friend had just offered some kind of 3-some ### service 😭\n\nAnd judging by the look on the guy’s face, I’m pretty sure he didn’t just think we were asking for a ride. He answered \"I am in hurry, I can't\", my friend asked \"what...?\", he repeated \"I am in hurry\", my friend added \"we will give you a Pringles\", he refused saying \"No\".\n\nWe went our separate ways. After that, my friend was upset with me because I kept laughing. He insisted that the sentence doesn’t mean anything like that at all.\n\nSo here’s my question:\n\nDoes it actually sound like that? And do you think the guy might have understood it the same way I did? Can you also make explanation where this meaning is hidden, I tried to explain him in all ways, he didn't understand 🤧\n\nTL;DR\n\nMy friend tried to ask a guy in a Mercedes for a ride but said, “can you ride us in your car,” which sounded very wrong. The guy looked shocked, refused (even after my friend offered Pringles), and left. My friend insists the sentence was normal, but I think it accidentally sounded sexual. Did it come across that way to a native speaker?",
  "author": "Hot-Taro-1555",
  "score": 221,
  "url": "https://reddit.com/r/tifu/comments/1pxj074/tifu_english_isnt_our_first_language_and_this/",
  "created_utc": "2025-12-28 06:12:13",
  "num_comments": 85
}