{
  "id": "1pxqg5q",
  "subreddit": "confession",
  "title": "I saw my mother raping my father when I was a kid, then she called me a pervert",
  "body": "My mother originally tried to leave my father then he knocked her up with me, when my father tried to leave my mother she raped him.\n\nThis was when I was about 11 years old. I lived in a remote town and for school holidays/Christmas we would drive down state to visit my uncle and cousins. My uncle had a two storey house with a granny flat downstairs, the granny flat had several beds e.g a bunk bed, then 3 other beds: one double across from the bunk bed then a single bed around the corner, and I think some random stretcher bed. The idea for guests or the kids to sleep down stairs (upstairs had 3 bedrooms). Often on the school holidays my cousins and I would all sleep downstairs while the adults got their rooms and we (the kids) basically had a slumber party downstairs every evening. The adults often drank upstairs while we watched TV and played games.\n\nAt some stage my parents split and my dad stayed with my uncle, my mother eventually took me down as usual to see my cousins. One night my father, uncle, mother, and several other people were drinking upstairs while my cousins and I were doing our thing. When we went to bed, my father stumbled downstairs and passed out on the double bed. Shortly after, my mother came down and started touching him then trying to kiss him. My father literally told her to fuck off. Shortly after, my mother climbed on top of him and started raping him. I tried to leave and while on top of my dad my mother aggressively threaten to kill me if I left, my cousins left. I rolled over then cried while my mother kept saying my name, while moaning, and I think was trying to make me watch.\n\nThe next day I woke up being the only person in the flat. My father was hung over af, my uncle threatened to beat the fuck out of my mother and father of they did that stuff ever again in his house, then my mother cornered me to tell me I'm a pervert, sick, and a slut. I was too young to understand what happened, now at age 30 I really wish my uncle had beat my mother. She was projecting on me hard-core trying to pretend I was the pervert and the sick freak when she was trying to force me to watch her rape my dad, in a room full of children. I do actually wonder if she was trying to get pregnant again to try get him to come back.",
  "author": "Kind_Membership33",
  "score": 2630,
  "url": "https://reddit.com/r/confession/comments/1pxqg5q/i_saw_my_mother_raping_my_father_when_i_was_a_kid/",
  "created_utc": "2025-12-28 13:40:58",
  "num_comments": 253
}