{
  "id": "1pxtuyy",
  "subreddit": "relationships",
  "title": "I keep thinking about leaving my fiancé over our sex life",
  "body": "I (25f) have been with my partner (27m) since I was 20. \n\nMy fiance was my first love when I was 15. We had met at a party but due to his conservative religion, we were never together. I got in a relationship with another man for almost 4 years, and all of those years he never left my head, even though we had no contact. \n\nWhen I was 20, we found our way back to each other and it felt so right. Everything was great. We moved in together in the last 10  months. It’s been great, he’s really good to me. \n\nMy frontal lobe also developed in that time. Or, I just grew up and realised our sex fucking sucks. \n\nI’m not sure what the average is per week, but I like having sex 3-4 times a week, and we usually do, but my fiancé cannot last in bed. I don’t know if I’ve ever had sex for more than 2-3 minutes. It’s even less now. 1 minute is pushing it. And if it’s anything over, he’s moving at such a snails pace to try to focus on not coming that it’s not enjoyable. We had sex tonight and he barely entered me and told me he was already going to come. This was with 0 foreplay too. I was just so ready because it’s all that has been on mind lately. He saw my frustration and said “sorry, it’s been a while” because he was away on a trip and just got back. He was away for 2 days!! And we had sex (if you can call it that) the night before he left, which also lasted around 15 seconds.  Sometimes he moves 2-3 times at a snails pace and comes. It’s infuriating because he’s always initiating this, and I never turn it down so I have no idea how he finishes so quickly. \n\nI’ve been getting so frustrated that I try to get myself off so I’m already aroused before sleeping with him, we won’t do any foreplay so he won’t come quickly. But it does nothing. It buys me an extra 10 seconds at most. I know people will say that PIV is not everything, but it is to me, and if he tries to go down on me to get me to come before we have sex, he will come in his pants or be so close to it by the time we have sex that sex itself feels like a waste of energy. I have been avoiding sex with him lately because it’s just not worth it, it’s already over before it starts. \n\nI kept wondering if it had always been this bad and realised that yes, it had. I just used to accept it because I love him and he’s been so good to me and he’s loved me since we were teenagers. He treats me so well that at the time I thought it was something that I could get over. \n\nLately though, I can’t even fake it anymore, I get visibly annoyed and irritated and I can tell it makes him feel awful. He has tried going to the doctors, only when I’m really fed up, and most of them have told him it’s in his head. and others have prescribed daily medication, which he doesn’t take. \n\nI’m so frustrated and feel so guilty that the lack of satisfaction is starting to turn me off him. I keep thinking what it would be like to sleep with someone else and experiencing sex that lasts longer than 1 minute. He loves to be at home with me and never wants to go spend time with his friends anymore because he says he would rather be at home with me, but I can’t wait when he has to leave the house so I can’t use my vibrator in peace, get myself off and fantasising about actually having good sex with someone else.  How fucked up is that? \n\nI don’t know what to do. I’m not a cheater and have never cheated, but leaving him continues to cross my mind. I don’t think I will ever have a good sex life with him. And the older I get the more I know it’s not something I can give up forever. \n\nI’ve thought about leaving him but I’m always held back by how good he is to me. We laugh daily together and never argue or fight. How I would explain to anyone that I left my fiance that treats me incredibly and visibly loves me because he can’t satisfy me? I can barely look at him at times out of frustration. It’s so messed up and I’m crying writing this. I feel so horrible. \n\nTL;DR:\n\nFor our whole 5 year relationship, my fiance has barely last 1 minute in bed. I used to think it was fine when I was younger because I didn’t care as much over my own pleasure, but now I’m so frustrated that I’ve began to fantasise what it would be like to be with someone else intimately. I don’t know what to do because he’s a great guy, he just can’t satisfy me sexually at all. ",
  "author": "Most-Wrongdoer4801",
  "score": 475,
  "url": "https://reddit.com/r/relationships/comments/1pxtuyy/i_keep_thinking_about_leaving_my_fiancé_over_our/",
  "created_utc": "2025-12-28 16:22:51",
  "num_comments": 88
}