{
  "id": "1py3t03",
  "subreddit": "tifu",
  "title": "TIFU by asking my ex to get back together with me on a goodreads review",
  "body": "Probably just did the most embarassing thing of my life. Soooo me and my ex broke up on somewhat mutual terms about 2 months ago, and we were mostly no contact since then until for christmas she reached out to me and asked me if I'd like to get coffee with her as friends. I agreed because honestly at the time I had more or less forgotten about her and thought it'd be interesting to see if we could click it as friends\n\nLong story short, it was not a good idea. The conversation was more or less normal and we discussed shared goals and ambitions for the new year, but I could feel feelings coming back as we were talking. Right at the end of the hangout we discussed our dating lives, and we both agreed that that just felt wrong, and maybe hanging out as friends wasn't a good idea, but we agreed to still talk about shared interests like books over text. \n\nRight after I started getting this really weird attachment limerance feeling towards her, as though I was breaking up with her all over again. I literally went 48 hours non stop thinking about her and although I didn't want to tell her that, I couldn't help wondering if she felt the same. So there was this book that we were both coreading together when we were still together and she was still right at the beginning and I had just finished. I had mentioned that I was going to write a review and she said, definitely do but make sure to add a spoiler warning because I don't want to read it until I'm finished. \n\nWhile writing this review I was still dealing with the aforementioned limerance so I added just randomly at the end the sentance \"\\_\\_\\_ I still love you please take me back\" and some other random bs ab how I was feeling at the time. Cannot stress enough, it was 1 sentance in a really really long review, that was covered by a spoiler header. I decided to keep it in for myself, because it was like talking to her without her actually knowing, and I uploaded it. \n\nAnyways this limerance wasn't going away so I decided to outright ask her today if she wanted to see me again, and add that I still had feelings for her after she responded based on her response. Unfortunately she responded with \"I think its best we keep no contact, I saw the review and it made me very uncomfortable\". I cannot stress enough that I didn't want her to look at it and I want to shoot myself so so much. I responded with I understand and a short reason as to why I put that in the review and how i didnt mean for her to see it. and I said yeah lets do no contact. She also blocked me on goodreads, but not on any other social media for some reason.\n\n I don't want to ever even see her again, but how does my ego even come back from this? I genuinely want to move countries because of this. \n\n  \nTL;DR:  Reconnected with ex, and caught feelings again, decided to put them in a goodreads review that she said she would't read. Decided to eventually try to confess them but she said she already read the review and it made her really uncomfortable. Then she blocked me on goodreads. and I want to die. \n\nEDIT: After some thinking and reading through the replies I realize what I did was weird and I shd have told her directly from the start. I'm worried that she thinks that I was trying to go out with her again without disclosing my feelings, because before i confessed I asked her if she wanted to see me again.\nShould I text her one last time to explain things?Or just leave it as it is and accept the fact that she might think I'm a creep.",
  "author": "Taikutsu4567",
  "score": 126,
  "url": "https://reddit.com/r/tifu/comments/1py3t03/tifu_by_asking_my_ex_to_get_back_together_with_me/",
  "created_utc": "2025-12-28 22:59:16",
  "num_comments": 49
}