{
  "id": "1py87fp",
  "subreddit": "tifu",
  "title": "TIFU by getting on my hands and knees for a pregnant woman",
  "body": "So just for honesty's sake this was not today but yesterday. The owners of one of my(24f) jobs often has work events we can participate in and they are always fun from my personal experience. This one in particular was through a company that bar hops on a vehicle that has multiple bicycle pedal stations. The owner herself is pregnant so she was not drinking while just about everyone else was. Well the owners husband moved to the empty spot that had pedals and the instructor insisted that someone sit with the owner because of her being pregnant and i love this woman so i volunteered. during the time we were sitting together we had some light conversations. one of them being me telling her that i would get on my hands and knees to help her down if needed. So me thinking it was funny i did just that when we stopped. My boyfriend/coworker(20m) gave me a weird look but i thought nothing of it. He and i are the first to leave because he had gotten mad about something unrelated. the rest of the night goes well and we get ready for work together and things are fine. I go to work today for my bf and his moms bf( both are coworkers) to have talked and then collectively decided that they needed to have a talk with me and tell me that i embarrassed myself, my boyfriend, and his mother by getting on my hands and knees. And before i know it my bf/coworker has begun to ignore me entirely. finally at the end of the day he asked me to talk outside and informed me that because of me getting on my hands and knees to jokingly act like a step stool for my boss that our relationship was in fact over.. So my PSA to you all no matter how funny you think it is, no matter how drunk you are, and no matter how much you think a person accepts you, DO NOT  and i repeat DO NOT get on your hands and knees for anyone in public. \n\n  \nTL;DR: I got dumped for getting on my hands and knees for my pregnant boss at a function for coworkers. ",
  "author": "trashmxbile",
  "score": 302,
  "url": "https://reddit.com/r/tifu/comments/1py87fp/tifu_by_getting_on_my_hands_and_knees_for_a/",
  "created_utc": "2025-12-29 02:05:47",
  "num_comments": 88
}