{
  "id": "1py9d7r",
  "subreddit": "tifu",
  "title": "TIFU by turning cleaning out my fridge into a game",
  "body": "My wife and I have a terrible habit of letting things go bad in the fridge, namely produce and leftovers. We take turns cleaning out the fridge and it was my month today. We had a TON of cheap to-go containers filled with leftovers that we haven't touched in God knows how long. I get kinda overwhelmed easily and starting chores is a gigantic mental block due to my ADHD.\n\nMy therapist suggested at one point that I turn chores into a game to see if it makes it any easier. To my surprise it did work for some things, like seeing how fast I can fold my laundry and try to beat it next time. I thought about how I could possibly turn cleaning the Darwinism from my fridge into a game, then I thought of it: garbage can basketball! \n\nAll the containers were sealed pretty tight and I kept the garbage can only a few feet from me, so I wasn't concerned about them busting open. Afterwards, I moved on to the produce. For some reason I thought it would be a good idea to move the garbage can about 10 feet away for this. I got all of them in with no issue. \n\nMy last thing to throw out was an english cucumber that was still completely wrapped. It definitely felt soft, but I didn't really think much of it. I tossed it towards the trashcan, where it bounced off the rim, hit the ground and *exploded*. \n\nIt was basically equivalent to a water balloon popping, except with the rotting stench of death. I had to race to toss my cats into the bedroom so they wouldn't go over to it, used an entire roll of paper towels and tons of lysol. I literally had to put on an N95 mask and put vicks vaporub on the inside of it so I wouldn't smell it as bad, but it only helped about 75%. It took me about half an hour to clean it all up. I'm never fucking buying cucumbers ever again. \n\nTL;DR: Played garbage can basketball with rotting produce to clean out my fridge and I missed when throwing a cucumber, which exploded on the ground and made my apartment smell like a corpse.",
  "author": "DumpsterPuff",
  "score": 501,
  "url": "https://reddit.com/r/tifu/comments/1py9d7r/tifu_by_turning_cleaning_out_my_fridge_into_a_game/",
  "created_utc": "2025-12-29 02:58:41",
  "num_comments": 55
}