{
  "id": "1pydvjk",
  "subreddit": "tifu",
  "title": "TIFU By going outside to swing in Hello Kitty PJs.",
  "body": "So, I (21F) like to swing in my backyard to decompress. Sometimes I go out in the middle of the day and sometimes I go out at like 9:00 at night when I get off work. My whole family knows and doesn't care. I just sit on the swings listening to music with my earbuds in, drifting off into La La Land. This time was no different. Now I do have to mention it was a bit chilly outside and it was at 9:22 when I went outside. I was only wearing Hello Kitty PJ'S as it was the only warm-est PJs I had at the time. So, I'm swinging for a good 20 minutes when I see my mother come out to check on me. Now I thought it was because the swings were being too loud as they do creak every time I swing or she was telling me to come inside because it was late. No, she just goes back inside so I continue doing my own thing. The nice thing I have to mention is my headphones were on full volume so I couldn't hear a damn thing. She then comes back out and gestures for me to come over to her, and I did. Still assuming my original thought. \n\nWell, it turns out a backyard neighbor called the cops on us! They called the cops concerned that a 10-YEAR-OLD GIRL is outside swinging with no proper winter attire on. Scaring the crap out of my mom because no kid under the age of 14 should be outside. Now she has a 10-year-old nephew but no daughter. She had to walk up to the cops after checking the backyard to tell them that instead of a 10 year old girl, it was instead her 21-year-old daughter. Safe to say she told me to come back outside between laughs. \n\nSo apparently me wanting to swing in the middle of the night in Hello Kitty pajamas was calling the cops worthy. Guess next time I have to wear less \"kid-ish\" attire or put on a coat so we don't have the cops on us again lol.\n\nEdit: I fix some gramical mistakes cuz it was bothering some people.\n\nTL;DR: I went outside to swing in my own backyard in Hello Kitty pajamas as adult. Nosy neighbor called the cops on us thinking I was a child swinging in the dark.",
  "author": "Infamous_Bad_6007",
  "score": 10214,
  "url": "https://reddit.com/r/tifu/comments/1pydvjk/tifu_by_going_outside_to_swing_in_hello_kitty_pjs/",
  "created_utc": "2025-12-29 06:33:22",
  "num_comments": 491
}