{
  "id": "1pyfsgm",
  "subreddit": "confession",
  "title": "The neighbour girl on the neighbor's balcony floor",
  "body": "I was 8 at the time. I had new neighbors across the street from my house; They were a couple (let's refer to them as boy and girl). From what I've heard from my parents, they were cool. They frequently invited us to their house to eat, to drink, and to play with their pet bird, anyways. I was hanging my newly washed clothes onto the dryer; it was cold and dark, so I could only see my neighbor's house and my house (obviously),  I saw them fighting; girl was on the stairs shouting at boy while crying, and boy was shouting back. They were so loud my parents could hear them from the inside of my house. Then, boy grabbed girl by her hair and dragged her to their balcony (our balconies are very close; I could jump from my house's balcony to their house's balcony), so I could see them and hear them clearly now. Then, boy gripped girls neck and slammed her head onto the balcony door, (It was wood); it was fucking brutal. Girl screamed, my parents were now concerned, and I was still watching as boy kept slamming girls head onto the wooden door, there was blood on her head and on the wooden door now. And then, he slammed girls head so hard it broke the door itself (it left a big hole; I don't know how this happened. I just know that boy broke the door using girls head) And then, girl stopped moving. Boy let his grip loose on girls neck, and looked at me, then he closed the balcony's wooden door and locked it, leaving girl on the balconys floor. I was so shocked and scared that I went inside. After that,  my parents, came to check on girl. I don't know what happened next, but I just know that they moved away a couple months later. It guilts me to this day, to not know what happened next, to not know what happened to girl.",
  "author": "CoolKevin_12",
  "score": 159,
  "url": "https://reddit.com/r/confession/comments/1pyfsgm/the_neighbour_girl_on_the_neighbors_balcony_floor/",
  "created_utc": "2025-12-29 08:18:23",
  "num_comments": 42
}