{
  "id": "1pyrwu9",
  "subreddit": "confession",
  "title": "I used something very personal that wasn’t mine and Im going crazy",
  "body": "I feel genuinely awful typing this but I reallyyyyyy need to get it off my chest. I was visiting home for a few days and staying with my family. I didn’t bring any of my own personal items with me which I didn’t think twice about at the time. Being back in my childhood home put me in this weird mental space bored, out of routine. At one point early in the visit I noticed a vibrator in my sister’s room. She’s an adult. We both laughed it off in a joking immature way and she made some offhand comment about how it was one of those quieter ones she ordered online whisper line vibrators or something I didn’t think much of it after that. Or at least I thought I didn’t. A couple of days later my family went out to eat and I stayed behind. I had been sleeping, half awake, bored and alone in the house. For reasons I still don’t fully understand that earlier moment came back into my head. I went to take a shower and instead of stopping myself like a normal rational person I went and took it. I honestly don’t know what took over me. There was no planning, no justification, just a split second decision that I immediately regretted. The moment it was over I felt sick to my stomach. It hit me all at once how invasive disrespectful and wrong it was. It wasn’t mine. It was extremely personal. Even though I cleaned it that doesn’t undo what I did. The shame is mental, not practical.  \n  \nI feel disgusting when I think about it. Not in a dramatic way but in a quiet heavy way that sticks with you. I keep replaying it and asking myself why I didn’t just walk away. I crossed a boundary that shouldn’t ever be crossed especially with someone I care about. No one knows. I haven’t told her. Part of me wonders if I should but I don’t know if confessing would make it better or just hurt her for no reason. It was genuinely a one time lapse in judgment and I will never do anything like it again. Still it’s one of those regrets that doesn’t fade easily.  \n  \nI’m not looking for validation or excuses. I know it was wrong. I just needed to admit it somewhere because carrying it around silently has been weighing on me.",
  "author": "LateReinstatement",
  "score": 226,
  "url": "https://reddit.com/r/confession/comments/1pyrwu9/i_used_something_very_personal_that_wasnt_mine/",
  "created_utc": "2025-12-29 18:13:17",
  "num_comments": 165
}