{
  "id": "1pyrcbh",
  "subreddit": "relationships",
  "title": "My (29M) girlfriend (26F) says no couples counseling without an engagement. How to move forward?",
  "body": "Hi all — I’m looking for outside perspective on whether I’m handling this reasonably.\n\nMy girlfriend (26) and I (29) have been together for 6 years. We met in college and have grown a lot together. She’s a genuinely kind, supportive, and loving partner, and I care deeply about her.\n\nAs we’ve started having more serious conversations about marriage, a few major topics have come up that I want clarity on before getting engaged — primarily sexual compatibility and finances.\n\nSexually, I have a higher drive and would ideally want intimacy 1–2 times per week. She’s comfortable with closer to once every 2–3 weeks and rarely initiates or suggests variety. I’m almost always the one initiating or trying to keep things fresh. Over time, this has started to feel unbalanced, and I’m worried about long-term resentment if it doesn’t improve.\n\nFinancially, I’m very focused on saving and long-term planning. I bought a townhome, run a small side business in addition to primary W2 job, and prioritize financial security. She values experiences and travel more. We travel together a couple times a year, but she also takes additional trips with friends. I usually opt out to save money. Recently, while discussing future goals like buying a single-family home, she said that if she couldn’t continue traveling at the same pace, she wouldn’t want to buy a home. That surprised me and raised concerns about alignment.\n\nBecause these feel like core marriage-level issues, I suggested couples counseling before moving forward. She’s strongly opposed unless we’re engaged. Her view is that counseling is a “wife-level” commitment and doesn’t make sense without an engagement. She also doesn’t like the idea of talking to a stranger and feels we should be able to work things out ourselves. We did try counseling once (online) and didn’t like the counselor, but I’ve suggested finding someone in person instead.\n\nShe’s now agreed to go, but says she doesn’t see the point and would likely say that in the session. She’s also shared that my hesitancy around engagement makes her feel like she’s “not good enough,” which I never intended but understand how it feels that way to her.\n\nI’m struggling to figure out whether I’m being overly cautious or if counseling before engagement is reasonable. To me, it feels like a way to strengthen the foundation and avoid future resentment. To her, it feels like an unnecessary hurdle without a formal commitment.\n\nHow do we move forward? or are we fundamentally misaligned in how we approach commitment and problem-solving?\n\nTL;DR:\n\nTogether 6 years and discussing marriage, but we’re misaligned on sex frequency and finances. I want couples counseling before engagement to work through these issues; she believes counseling is a “wife-level” commitment and won’t do it unless we’re engaged.",
  "author": "8BlackCarrots",
  "score": 202,
  "url": "https://reddit.com/r/relationships/comments/1pyrcbh/my_29m_girlfriend_26f_says_no_couples_counseling/",
  "created_utc": "2025-12-29 17:52:29",
  "num_comments": 87
}