{
  "id": "1pysitp",
  "subreddit": "tifu",
  "title": "TIFU by saying \"downtown hashbrowns\" in a grocery store aisle.",
  "body": "I find it funny in hindsight, because it's such a whatever thing, but anyways, a little bit of background. I have some MH (mental health) issues, and I have my good days and bad days. Whenever I have a bad day (like today), I usually try to stay home just because if I go out in public and something trips me up, it can pretty much ruin my whole day. and by ruin I mean I have to do all this other stuff that preoccupies me/takes up my time and energy to keep myself grounded. It's a whole thing, but whatever, not the point.\n\nWhat IS the point, is that if I DO have to go out to in public, I picked up some techniques to help keep me grounded in high public areas. Namely one of them being I talk to myself, or say random bullshit, or just have a conversation with myself. Helps distract me and preoccupy my mind. Normally I don't have to do this as often if the place isn't as busy, but it was a busy day at the grocery store.\n\nAnyways, went shopping, place was super busy as I mentioned, and I woke up this morning knowing I am going to have a bit of a time today (and I take my meds in the evening, not the morning). Soo...I defaulted to what I do to deal with it, just saying random bullshit.\n\nFor the most part? Everything was going well. Got my bread and stuff, I was reciting IASIP (It's Always Sunny In Philadelphia) quotes under my breath, specifically \"You gotta pay the troll toll\", \"can I offer you an egg in this trying time\", etc. You know.\n\nI head over to the frozen food aisle, specifically to grab some hashbrowns, was in a good mood, making myself laugh. Spent a few minutes looking for them, they weren't were they normally were. Apparently, The store moved the hashbrowns I like to get to the bottom row of the particular freezer I was at, and then, without skipping a beat I said \"The hashbrowns are downtown\". Made me laugh more, and then I started saying \"oooh girl, you got them downtown hashbrowns\" in the tune of the opening to that song \"Holidae In\" by Snoop Dogg, Chingy, and Ludacris.\n\nSo I was singing, still not too loud, sort of to myself that the store, \"ooh, you got them downtown hashbrowns, ooh, ya' know you got it, ooh girl, them downtown hashbrowns\".\n\nAfter grabbing them, and throwing them in my cart, probably just seconds after I felt someone poke my shoulder and turned to see this really old lady. Like, older than you can probably imagine. Super old. Not a day under 90. and she just looked so damn irritated.\n\nI asked her what was up, and she said \"that's inappropriate to say that in public, you should be ashamed of yourself\". If you are like me, which you probably are, you would have been like wtf, did I say exactly? So I inquired, and she was specifically saying I shouldn't be talking about lewd things in public like a woman's body in the manner that I was.\n\nI clarified I literally meant hashbrowns on the bottom shelf, she wasn't having it, so whatever take the L Lucha, you will just be known as a filthy mouthed dude by this old lady.\n\nContinued shopping, only two registers open, a 14 or less, and the self checkouts were taken up (and I don't like using them when I have a lot of shit) so while waiting and after being distracted by the magazines on the end cap, I look up and noticed \"Mother Superior\" herself in front of me, cutting me looks, talking mad shit about me, TO the cashier, with me in direct ear shot. The cashier was some middle aged lady, of course. The bagger was also a middle aged lady.\n\nYou could see the cashier processing what she was rattling on about, but whatever, she leaves, I go to ring my stuff up, and she got to my hashbrowns and just was like \"ok sir, sorry, what's this about hashbrowns\"?\n\nI told her the story, she didn't seem to get it, so I tell it again, and she still didn't get it, but figured out at least that it was the old lady being difficult and wanting to complain, but the bagger still didn't get it and was cutting eyes at me, and whatever. I grabbed my stuff and went about my way. Looked over my shoulder cause I heard talking, and it was both of them talking about me as I was leaving.\n\nIt's a grocery store I frequent, so I basically have to go there, so I am probably going to be known as the hashbrown guy in perpetuity.\n\n**TL;DR: I speak to myself as a grounding exercise to deal with my MH (mental health) issues. I had to go into public today during a bad MH day where I needed to do said exercise. I got fixated on a funny phrase \"ooh, you got them downtown hashbrowns, ooh, ya' know you got it, ooh girl, them downtown hashbrowns\" and was sing-songing it to myself. Was overheard by an old lady, she thought I was being inappropriate about women by referring to their \"downtown hashbrowns\". She told the cashier and bagger, and I am probably known as some sort of hashbrown deviant now or something.**",
  "author": "LuchaLutra",
  "score": 261,
  "url": "https://reddit.com/r/tifu/comments/1pysitp/tifu_by_saying_downtown_hashbrowns_in_a_grocery/",
  "created_utc": "2025-12-29 18:35:57",
  "num_comments": 154
}