{
  "id": "1pz3rgi",
  "subreddit": "confession",
  "title": "I’m struggling deeply with this and I’m honestly stuck.",
  "body": "I’m an 18-year-old woman, and I’ve been carrying a lot of guilt, shame, and self-hatred over sexual experiences that happened repeatedly throughout my childhood. I’m posting because I don’t know how to reconcile what I understand now with what happened then.\n\nFrom very early elementary school, there were multiple situations involving other children where boundaries weren’t clear, adults weren’t supervising closely, and I had no real understanding of sex, consent, or consequences. At the time, it felt confusing and overwhelming rather than intentional or thought-out. Sometimes I went along with things, sometimes I didn’t fully know how to respond, and sometimes I was just copying behavior without understanding what it meant. Because of that, I’ve struggled deeply with blaming myself.\n\nAs I got older, early exposure to sexual content made things more complicated. I didn’t know how to process what I was seeing, and I repeated behaviors without understanding the harm, meaning, or emotional weight behind them. When adults eventually became aware and intervened, the behaviors stopped, but the shame never did. I haven’t engaged in anything like this since early adolescence.\n\nNow, with adult awareness, everything feels different. I look back and feel intense guilt and disgust toward myself, even though I know logically that I was a child without the brain development or understanding to make informed choices. I constantly question whether I’m a bad person, whether I deserve love, and whether my future is somehow damaged because of this. I also worry about how others would see me if they knew, and that fear keeps the shame alive.\n\nI understand, intellectually, that children don’t process things the way adults do — but emotionally, I feel stuck. I feel responsible for things that happened before I had the capacity to understand what I was participating in. I want to heal, but I don’t know how to let go of guilt when my adult mind keeps judging my child self.\n\nI’m not looking for validation to excuse harm — I’m looking for perspective, honesty, and insight from people who understand childhood trauma, early sexual exposure, or complicated shame. How do you move forward when your logic says one thing, but your emotions say another?\n\nPlease be kind. I’m already struggling a lot with this.\n",
  "author": "always_crying-2288",
  "score": 203,
  "url": "https://reddit.com/r/confession/comments/1pz3rgi/im_struggling_deeply_with_this_and_im_honestly/",
  "created_utc": "2025-12-30 01:54:09",
  "num_comments": 135
}