{
  "id": "1pz7xnt",
  "subreddit": "tifu",
  "title": "TIFU by popping my girlfriend's vulva pimple",
  "body": "This happened about five minutes ago and I think it must surely be my first ever original experience. I have no clue who else might have experienced this before.\n\nI (22F) and my partner (21F) have a gross hobby: popping each other's pimples. Most nights, we pop a gummy, pull put a flashlight and our pimple-popping tools, and take turns going to town. \n\nToday, however, we decided to do something a little more special, so we pulled put our volcano and smoked a little. My partner said that she had an ingrown hair on her labia lip, so I went to dig it out, which I have also done before.\n\nIt, however, was not an ingrown. It was a massive, bulging, pimple. I cannot emphasize how much this zit was a ripe fruit in peak picking-season. I immediately begged her to let me pop it, which she agreed to, hoping it would relieve the soreness.\n\nI pulled out our pimple-popping tools and gave it a little poke with one of the needle-tipped ones. I gave it a squeeze, and I swear to God, my life flashed before my eyes.\n\nI could not see out of my right eye.\n\nThe pus from the pimple shot out of my partner's labia and catapulted INTO MY EYEBALL. \n\nI blinked in horror, vision still blurry. I began to panic, which made my partner also panic, and I began yelling about how it got IN MY EYE and I was not joking (it definitely is the kind of prank I usually play). According to her, my face had splatters of pus and pimple discharge on it. My eye kind of burned a little, but after I rinsed it out, all was well and my vision was once again 20/20. Luckily, we both have clean STI tests so at least I do not have to worry about chlamydia of the eyeball.\n\nI told her we should take this to the grave, but she said we should disgust Reddit instead, so here we are. \n\nTL;DR: popped a zit on my girlfriend's labia lip and the pus shot into my eyeball.\n\nEDIT:\n\nTrip to urgent care confirmed this is indeed just a pimple! Not a cyst and not HSV1. Was told to keep an eye out... on my eye, but probably in the clear. Glad to have bonded over the fellow pimple-poppers and I hope you all learned from our grave mistake and go get some safety goggles. I also would like to add some clarifications:\n\n1. Most nights we check for pimples, but it ends up lasting for 30 seconds because there isn't anything new. Yes I know popping pimples can make them worse, but it's satisfying so I don't really care\n\n2. My face was a good 2-3 feet away, so I did not at all expect it to shoot that far out\n\n3. Fuck AI!",
  "author": "sleep-deprived-thot",
  "score": 10153,
  "url": "https://reddit.com/r/tifu/comments/1pz7xnt/tifu_by_popping_my_girlfriends_vulva_pimple/",
  "created_utc": "2025-12-30 05:03:27",
  "num_comments": 1546
}