{
  "id": "1pzbodk",
  "subreddit": "confession",
  "title": "I was touched on a bus and haven't told anyone yet",
  "body": "It's weird. I'm 15(m) Last night I was comming home by a bus, it was pretty much empty I was sitting in the back a few people were sitting at the front seats, mostly asleep. I tol was getting sleepy but had to stay up to reach home and not miss my stop. There was this woman that was sitting like two seats infront of me, after a while she got on a call (or pretended to maybe idk) and then she started recording the surroundings like she was vlogging or something and I could see her recording me but I didn't say anything. And then for some reason she came and sat next to me, I don't remember many details, i think she was in her 30's or late twenties Idk. I closed my eyes for a while to rest them then I noticed At first she put her hand on my thigh, I didn't think much of it, was a bit weirded out but it was whatever. I was getting tired I don't know what had happened I guess after i closed me eyes for a while and i could feel her hands moving and she was like putting her hands over my crotch and squeezing my genitals... I shifted closer to the window to have her hands shift away from me and leave me alone but she inched closer to me and I can remember her  as she was taking my hand in her own and forcibly putting it over herself like on her chest and her privates, i pulled myself back, it was gross so I got up and sat at one of the front seats and my stop arrived sometime later so I got off. It was so weird like it leaves me feeling shame. What should I do. I was very sleepy last night too so I don't remember much except this from last night. It was an old roadways bus none of them have CCTVs around here. And I don't wanna tell this to anyone i didnt pay attention to the bus number or anything because I didn't anticipate anything like this to ever happen. I'm just feeling shame, alot of it. ",
  "author": "Mysterious_Log6691",
  "score": 180,
  "url": "https://reddit.com/r/confession/comments/1pzbodk/i_was_touched_on_a_bus_and_havent_told_anyone_yet/",
  "created_utc": "2025-12-30 08:20:23",
  "num_comments": 77
}