{
  "id": "1pzch5l",
  "subreddit": "relationships",
  "title": "How to Dump your GF of two weeks who has severe anxiety, mental break downs and panic attacks",
  "body": "I (male; 25 years old) and my GF (female; 22 years old) have been together for about 2 weeks. She is a student at the same university I attend, and we have gone on a total of three dates. We had seen each other in uni before but started talking on Instagram.\n\nOn the very first date we were talking and I, by mistake, called her by another name (I sometimes confuse names) and she didn't take it well at all. She started shivering and and got up and said, this was a mistake and went to her female friends and had a melt down. She had tears and even skipped class and all the time her friend was consoling her. I was also there trying to calm her down. Eventually, she calmed down and we went for a coffee where I told her I sometimes forget and confusenames and dates (which the way it came out from my mouth looked like some mental problem.\n\nWe call daily and she has grown incredibly attached to me. She even has planned out when we are going to marry, what the names of our children would be and all the things in between. I did at times tell her that she needs to get some professional help to deal with the panic attacks and anxiety and that she needs some goals to get attached to. Everyday she asks me \"You won't leave me right?\" And I just feel really sad when I tell her to not worry. I'm worried about how this breaking up would effect her. \n\n\nI mean, we did started off saying we are not looking for casuals and want a long-term thing where marriage is expected (I live in South Asia where marriage is how it should go if you are serious). This has been her first ever relationship. \n\nShe has told me about her anxiety and panic attacks and I have experienced it first had over the 2 weeks of us being together. I'm not sure I'm the right one for her. She has grown incredibly attached. I want a way out without making it hard for her and soon so that she is fine with losing me and can explore other options and not waste her time with me. I have made up some issues relating to me and my fam and that I have dementia, drug abuse and would probably go bald in 2 years combined with all sort of other things to make her dump me instead but she says she doesn't mind much. She genuinly thinks I have these problems and that she can \"fix\" me. She is incredibly smart, sweet and kind and good looking and I just realized I don't want a relationship and want to focus on my studies.\n\nAny help and suggestions in this regard would be really helpful. Also her exams starts in like 2 weeks. Should I make my move before or wait for the exams to finish? \n\n\nTL; DR: How to dump my girlfriend as smoothly as possible without making it hard for her.",
  "author": "Professional_Grab313",
  "score": 235,
  "url": "https://reddit.com/r/relationships/comments/1pzch5l/how_to_dump_your_gf_of_two_weeks_who_has_severe/",
  "created_utc": "2025-12-30 09:07:57",
  "num_comments": 151
}