{
  "id": "1pzdneo",
  "subreddit": "confession",
  "title": "I used an exploit to steal from my first job and was never caught.",
  "body": "I used to work for a store here in the USA that popular in rural area. You see this store everywhere sometimes 2 location will be a mile apart on the same road!where I lived there was 5 locations on a 2 mile range.\n\nI worked the register most nights while the lead would be doing whatever it was she did. Sometimes we had sales and they had a manual code you would type for the items on sale. That code was different everytime. One day I hit the wrong button and the code took 90% off instead of 25% it was mean to. The lead came up and helped me fix the transaction but I remembered the code and wrote it down and shoved it in my jacket pocket and forgot about.\n\n \nAbout a month later I found the paper in my pocket. I tried the code again at work that night and it worked. The codes had changed but this one stayed as 90%. After thinking about it almost all night I decided to go with a friend and see if we could get an employee at another store to use the code. So we grabbed a few items and went to check out. After she rang up our stuff I told her I had a I had a code. She paused for a minute but I said I worked at the store closer to town and she didn't say anything else and typed it in. Sure enough it worked. \n\n\nI spent the next week at work waiting for someone to say something but it never happened. I thought for sure that woman would say something but she didn't. About to weeks later I went  back and did the same thing but this time I had more stuff. I told her the code and that she accepted it and we went on about our day. \n\n\nI was feeling really good after that and I relaxed. No one was gonna know. So I started buying everything there. A whole cart of food, clothes, cleaning supplies you name it. If I seen that same cashier in there I would load up because I knew she wasn't talking. No one other than my mother was suspicious of it. A full year I'm pretty sure we got 5 or 6 band worth of \"free\" stuff easy. \n\n\nAfter a fell year of doing this the code stopped working. I guess they discovered the code and removed it. I was in the process of moving and had quit by the time it stopped working so I wasn't worried about being fired for it. I used to feel guilty about it but now that I'm much older (I was 18/19 when this happened) I actually don't feel bad. This company has be caught doing so much illegal stuff and not paying employees correctly that I don't care. I won't even shop at their stores even if there one on every corner. ",
  "author": "thekingsteve",
  "score": 1649,
  "url": "https://reddit.com/r/confession/comments/1pzdneo/i_used_an_exploit_to_steal_from_my_first_job_and/",
  "created_utc": "2025-12-30 10:20:25",
  "num_comments": 226
}