{
  "id": "1pzf9ic",
  "subreddit": "tifu",
  "title": "TIFU by suggesting KFC would be cheaper than Turkish takeaway, and ending up in a national news story",
  "body": "Not actually today, but 2 days ago.\n\nIt was Sunday night, my partner's parents had just left after being here for Christmas. We had been doing a lot of cooking, as is obligatory at this time of year, and so decided we'd get takeaway for dinner. \n\nMy partner wanted to try and Turkish place, so we added up the basket and it was £70+. I had fancied KFC, so suggested that would be like a third of the price, and she agreed. Oh how wrong I was.\n\nDrove out to collect it, picked it up, munched a bit of BBQ chicken in the car park before driving home. About 5 minutes from the KFC, and oncoming car pulls into my lane to overtake someone. I remember thinking \"They wont just drive into me... they wont just drive into me... they...oh fuck\" and then a nice crunching sound, some spinning and some shock. Tried to get out of the car, but my door wouldn't open. The passenger door did though, so I climbed out of that, patted myself down and surveyed the damage.\n\nThankfully I wasn't severely injured, but looking at my car you'd be surprised I walked away. It was completely totalled, the front hanging off, windows smashed, wheel hanging off, the lot. \n\nI checked the driver of the other car was OK, and he replied yes while reaching over the passenger seat so I walked away. After a few minutes, people started shouting \"He's got a gun\" (in the UK, so pretty rare). I only half believed it until a guy I had spoken to earlier said the driver was leaving, he tried to stop him and he threatened him with the gun. \n\nThe driver of the car he had overtaken pulled over to tell me to get in, but I saw blues on the horizon so figured I'd wait it out.\n\nEnded up having to wait around for about 4 hours, giving various statements, while the Police found and shot the other guy in the end.\n\nSo far I've since spent £400 hiring a car for 10 days (the wrecked one was our only car after the other failed it's MOT spectacularly and wasn't worth repairing), £150 on a new car seat (thankfully kids were in bed when it happened), and £10 on a new watch strap. Oh, and we never did get to eat the KFC.\n\nThat £70 Turkish sounds pretty cheap right now.\n\nTL;DR: Suggested KFC would be cheaper than alternative takeaway, ended up in a car wreck that's cost over £500 so far.",
  "author": "Cuznatch",
  "score": 5497,
  "url": "https://reddit.com/r/tifu/comments/1pzf9ic/tifu_by_suggesting_kfc_would_be_cheaper_than/",
  "created_utc": "2025-12-30 11:59:12",
  "num_comments": 294
}