{
  "id": "1pzrxjq",
  "subreddit": "tifu",
  "title": "TIFU by cooking the wrong meat for a mystery dish",
  "body": "I'm home from work for the holidays, and was left some instructions about a meal my wife wanted me to cook while she's gone for the day. I tried to ask her what dish it was but she was busy getting ready and just said \"the instructions are on the counter.\" Couldn't be that difficult. I didn't ask again and went on my merry way. After she left I found the instructions and got to work.   \n  \nFirst item, brown the beef and add it to the crockpot. Okay, easy enough. I open the meat drawer in the fridge and there's only 1 item, ground beef. I follow the rest of the instructions on autopilot. I'm handy enough in the kitchen but the majority of the cooking and meal planning in the house is done by my wife since she stays home during the day. I don't know what the dish is but if I follow the recipe, what could go wrong? I finish putting all the ingredients into the crockpot and... I have no idea what I've cooked. Onions, carrots, cooking wine, ground beef... oh well, who am I to question the all-mighty instructions?\n\nFast forward an hour and it's time to cook the kids lunch. I start poking around the fridge and... hidden on the bottom shelf, what do I see but a nice large chuck roast. I literally jumped back in shock. I looked at all my ingredients in the crockpot including onions, carrots, red wine, and browned ground beef and realize I was supposed to be making pot roast.   \n  \nI had to excuse myself so the kids wouldn't see me crying. On the bright side it smells great...  Wasted probably 20 dollars worth of food. Ruined the dinner my wife specifically asked me to make. I'll be eating ground beef pot roast for the next week as penance I guess.\n\nTL;DR I didn't know what dish I was making for dinner and put ground beef into the pot roast.",
  "author": "Unfairamir",
  "score": 337,
  "url": "https://reddit.com/r/tifu/comments/1pzrxjq/tifu_by_cooking_the_wrong_meat_for_a_mystery_dish/",
  "created_utc": "2025-12-30 20:52:49",
  "num_comments": 59
}