{
  "id": "1pzvrwc",
  "subreddit": "tifu",
  "title": "TIFU by trying to let someone know im not a threat but instead got pepper sprayed.",
  "body": "As the title says, I have this thing where I try to make a sound or something similar to that when I’m walking down an alley or some dark unlit road/street with another individual just so that they know I’m there walking in the same direction as they are walking, so I was walking on this road, no street lamp or anything and as I usually do, I started making sound with my lighter turning it on and off so that they know that there’s someone else there as well and they shouldn’t be scared or feel like there’s somebody following them like just a heads up, but to my luck that girl turned around and didn’t see shit because it was a very dark alley, so as I get closer and closer, I was trying to pass them so that they can see me walking in front of them, not behind them, just to give her a sense of safety, and then I get close enough and she gets scared the shit out of her and starts to panic and she stats to pepper spray me, the pain was unimaginable. I never knew pepper spray would burn that much and she was crying and trying to help me at the same time asking me why didn’t I show myself or said anything? I said I did. I was making noises with my lighter, she said I turned around, but I didn’t see anything and that made me even more scared. Long story short she apologized profusely and said that I should improve my way of letting others know that there is someone behind them, anyways I’m never gonna do that again.\n\nTL;DR: i got pepper sprayed because i came out as a creep who was stalking someone while i was just tryna get home.\n\nEdit: just an explanation and more context for everyone, i usually use my phone and turn the volume all the way up and scroll thru instagram, but this time my phone was dead and the only thing i could think of was my lighter\n\nİ wasnt walking behind them as i flicked my lighter, i just flicked a quick couple of times.\n\nAlso the girl turned out to be a friend of a friend, our next hang out should be interesting.",
  "author": "Intrepid-Beyond2542",
  "score": 176,
  "url": "https://reddit.com/r/tifu/comments/1pzvrwc/tifu_by_trying_to_let_someone_know_im_not_a/",
  "created_utc": "2025-12-30 23:28:39",
  "num_comments": 232
}