{
  "id": "1pzwqoq",
  "subreddit": "relationships",
  "title": "Friends constantly one-up us financially. How do I shut this down without ending the friendship?",
  "body": "My (33F) husband (33M) and I have been close friends with a married couple (both 32) since school (friends for 22 years). They’re our best friends and we mostly have great times together which is why I don’t want to lose the friendship.\n\nSince having our own children (both toddlers) the dynamic has shifted and everything feels like a financial competition. The husband is a high earner (£100–200k, maybe more with commission) and his wife doesn’t currently work, yet they’re obsessed with being ‘frugal’ and always having a one-up.\n\nIf we mention a holiday, they’ve done the same cheaper. If we buy something, they’ll tell us they bought a cheaper or “better” version elsewhere. At Christmas, we bought our son a Toniebox and they made a point of explaining why their daughter’s Yoto Mini is superior. The husband has also talked about retiring in 5–10 years (he’s currently early 30s), which feels unnecessary given we work hard and realistically won’t ever have that option.\n\nWe live very modestly (small house, second/third-hand cars, within our means etc.) but these comments leave me feeling subtly judged or framed as frivolous, even though I don’t think they’re trying to be unkind.\n\nI’m looking for advice on:\n\n• What to say in the moment when the one-upping happens\n\n• Whether this is something worth addressing directly or if that would make things awkward.\n\n• How to mentally disengage so it doesn’t keep bothering me.\n\n• Or whether this is just a sign the friendship dynamic has changed.\n\nI like them and don’t want to end the friendship. I just want to stop feeling deflated after spending time together.\n\nTLDR: Long-term friends constantly one-up us financially. We live modestly and aren’t competing but their comments leave me feeling judged and deflated after seeing them. I value the friendship and don’t want to end it. I’m looking for a way to respond and deal with the situation. ",
  "author": "kireflurry",
  "score": 371,
  "url": "https://reddit.com/r/relationships/comments/1pzwqoq/friends_constantly_oneup_us_financially_how_do_i/",
  "created_utc": "2025-12-31 00:09:03",
  "num_comments": 105
}