{
  "id": "1q0272w",
  "subreddit": "tifu",
  "title": "TIFU by blowing up at my retired dad and calling him childish over a small favour",
  "body": "I live alone with my dad. He’s retired and stays home most of the time since he isn't super social. He keeps himself busy with gardening and DIY stuff, but honestly, his favorite thing is cooking. He’s always on youtube or tiktok looking up new recipes to make for us, and he’s amazing at it.  \nLately, I’ve been buried under a mountain of work and college stress. I’ve felt bad that I don’t get much time to spend with him, so I’ve actually been planning to surprise him with a dog soon. He’s obsessed with our neighbor's dog, and I thought it would keep him company while I’m busy. Yesterday, I was in my room struggling with my studies and feeling a lot of pressure from my job. My dad came in and asked if I could do him a favor. I told him I’d help him in a bit because I was right in the middle of something.  \nHe came back up later and said the favor actually involved my friends and colleagues. I was totally confused. Then he explains that he needs me to help him with some slash thing on tiktok. I just snapped. I told him it was incredibly stupid and that I wasn't going to annoy my friends and professional coworkers with some silly game. He tried to laugh it off and said it was just for fun, but I got really rude. I told him to stop behaving like a 10-year-old and that I have enough real-life problems to deal with without his stupid games. He didn't even argue. He just got really quiet and went back downstairs.  \nThe fuck up is that I realize now I totally overreacted. He’s a great dad. He spends his day making food and looking after the house and I talked to him like he was a nuisance over something that would have taken two seconds to handle politely. I feel like I completely crushed his spirit just because I was having a bad day.  \nHow do I even make this up to him now?  \nTL;DR: My retired dad asked me to help him with a challenge while I was stressed with work. I blew up at him, called him a 10-year-old, and now I feel like a monster because he’s been avoiding me ever since.",
  "author": "RepulsiveSpites",
  "score": 313,
  "url": "https://reddit.com/r/tifu/comments/1q0272w/tifu_by_blowing_up_at_my_retired_dad_and_calling/",
  "created_utc": "2025-12-31 04:10:38",
  "num_comments": 83
}