{
  "id": "1q0dc13",
  "subreddit": "confession",
  "title": "I have lied to my son about manatees for the last 24 years",
  "body": "24 years ago, my 6-year-old son got me a birthday present. It was a mug with a picture of a manatee on it. He got upset when I wasn't sufficiently thrilled with his gift. I assured him that I loved it, saying that manatees were my favorite animals in the whole wide world.\n\nSince then, manatee themed items have been my default gift from him. Manatee shirts, manatee calendars, manatee beer steins, and so much more. 24 years of manatee items, displayed proudly in my home.\n\nMy confession is that manatees are not my favorite animal in the whole wide world. Never have been. I have nothing against them and they seem like gentle creatures, but they hold no fascination for me. I only said I loved manatees to soothe the feelings of my young son over two decades ago. Year after year, I rolled with the lie because it was harmless and I was in too deep to tell him the truth.\n\nNow my deception has reached it's zenith. Next year I am turning 55 and he is turning 30. For Christmas, my son has booked a trip for the two of us to go to Florida to see manatees. My son is so excited for this trip and is telling everyone in our family about it. Even my ex-wife is gushing about my trip to finally see the manatees.\n\nOf course, I am thrilled to spend time and have an adventure with my son. I am grateful for his thoughtfulness and love for his old man. We will have a lovely time together and make great memories. And I will continue the deception about the manatees... which are not my favorite animals in the whole wide world.\n\nEdit - Thank you for the award and the laughs. For those asking, my favorite animals are dogs. Happy New Year!",
  "author": "46from1971",
  "score": 61130,
  "url": "https://reddit.com/r/confession/comments/1q0dc13/i_have_lied_to_my_son_about_manatees_for_the_last/",
  "created_utc": "2025-12-31 14:44:12",
  "num_comments": 4772
}