{
  "id": "1q0di7f",
  "subreddit": "tifu",
  "title": "TIFU by trying to impress my coworkers with homemade lunch",
  "body": "So ive been bringing my lunch to work, usually just basic stuff like sandwiches or leftovers but this time I decided to get fancy because theres this girl in accounting I wanted to talk to and shes always in the break room around noon.\n\nI made this salmon dish that looked amazing. Like restaurant quality stuff with this lemon butter sauce. Put it in a nice glass container and everything. I had this whole elaborate plan where while we were talking about the food id casually invite her to this nice Italian place downtown. I even have some money set aside from Stаke that I wanted to spend on a proper date with her, like somewhere actually good not just chipotle or whatever.\n\nGet to work and put it in the communal fridge. Lunchtime comes around and I heat it up in the microwave. The smell fills the ENTIRE floor within seconds. Not like a good smell either, like overwhelming fishy smell that made people start complaining immediately. But I already committed so I took it to the break room where accounting girl was sitting with like 4 other people.\n\nI sit down trying to act casual and take a bite. Literally the moment I do, I feel something crunchy. Turns out I didnt debone the salmon properly and there were these tiny bones throughout the whole thing. I tried to be subtle and spit it into a napkin but I started choking a little bit and everyone noticed.\n\nAccounting girl asked if I was ok and I tried to say yes but another bone got stuck in my throat. Started coughing harder. She had to come over and pat my back while everyone watched. The smell was still destroying the room and someone opened a window even though its like 40 degrees outside.\n\nFinally got the bone out but my eyes were watering and my face was red. I just grabbed my container and left. Spent the rest of lunch in my car. Then HR sent out an email later asking people to \"be mindful of strong smelling foods in shared spaces.\"\n\nPretty sure my chances with accounting girl are dead and now im known as the fish guy. That money I wanted to spend the date is just gonna sit there mocking me.\n\nTL;DR brought fancy salmon to impress a girl at work, filled the office with terrible smell, choked on a bone in front of everyone, got a passive aggressive email from HR. My elaborate dinner date plan died before it even started",
  "author": "Jolly-Mirror3655",
  "score": 713,
  "url": "https://reddit.com/r/tifu/comments/1q0di7f/tifu_by_trying_to_impress_my_coworkers_with/",
  "created_utc": "2025-12-31 14:52:38",
  "num_comments": 136
}