{
  "id": "1q0ifjk",
  "subreddit": "confession",
  "title": "My mom thinks an iron frog lawn statue is her dead sister",
  "body": "My aunt sadly lost her battle with depression and died by suicide 20 years ago. I was 19 years old and it was a pretty rough situation, especially for my mother. The day after it had happened I hung out with my group of friends to get my mind off of things. At that time we were all in between our freshman and sophomore year of college so none of us could legally drink, or go to bar. So to kill time in our suburban town we would cruise around late at night to “cause a ruckus”.  It was generally silly things like ding dong ditch or we would rearrange lawn decorations in our friend’s parents yards or bring Taco Bell to the Wendy’s to barter for food in the drive thru. \n\nOne night we decided to split up and see who could find the silliest thing to “borrow”. My friend took a portable cross walk sign from a grocery store which he later put back but in the loading dock area. I worked at a lawn and garden center and snuck on to the property and took an 80lbs iron frog lawn ornament. My plan was to return it next time I worked but I needed a place to put it for a day or two because my dad would be confused as to why it was in the trunk of the car. \n\nSo my dumb young mind decided it would be a good idea to set it next to the landing of our front door in the stones. There were already some other similar ornaments around so I thought it would go unnoticed. The next morning my mom was in a surprisingly happy mood. She had gone to get the mail that morning and found the frog. My mom asked if we knew where it came from and I immediately denied knowing. \n\nUnknown to me my aunt loved to collect frogs when she was a kid and would hide them all over the place. My mom was convinced it was a message from my aunt that she was OK. The frog has since moved to multiple houses over the years too. It sits next to her outdoor rocking chair. I have never had the heart to tell her that I put it there. Maybe it was my aunts doing and she used me to deliver the message? Anyway, every time I go to my parent’s house I see that frog and it reminds me of my aunt. ",
  "author": "Bassmasterajv",
  "score": 523,
  "url": "https://reddit.com/r/confession/comments/1q0ifjk/my_mom_thinks_an_iron_frog_lawn_statue_is_her/",
  "created_utc": "2025-12-31 18:26:48",
  "num_comments": 45
}