{
  "id": "1q0q427",
  "subreddit": "tifu",
  "title": "TIFU By calling a patient “Diabetes”",
  "body": "(Fake names for anonymity) I’m a 25 y/o dental assistant. My usual routine for getting patients from the waiting room to the dental chair goes as follows: 1. Read the patients name\n\n2. Read their medical history and circle anything they marked down so I can easily enter it later\n\n3. Call the patients name and walk them back to the room.\n\nSuper simple, right? So as I’m doing my usual thing, I see the patient marked diabetes on their medical history. I circle it and walk around the front desk to call his name. Instead of saying “Marcus,” I say “DIABETES” loudly and confidently before my heart sinks to the floor. My face turned bright red, I looked over at the receptionist, who looked confused, and put my face in my hands before turning around.\n\nI didn’t even correct myself. Everyone in the waiting room looked so confused. I literally didn’t know what to do. So I went back to our assistant office and told the other assistant what happed with tears of embarrassment in my eyes. She thought it was hilarious, and after the embarrassment has worn off a little, it kinda was, but it was also a huge HIPAA violation.\n\nIf I’d called his name after shouting what was on his medical history, I feel like it would’ve just made things worse. Eventually the other assistant agreed to seat my patient for me so it was less obvious. I told my boss about it later and she wasn’t as amused as the assistant. She told me to be more careful with patient information. I think this might be one of those things that keeps me up at night for years. Cringe to death.\n\nTL;DR I accidentally called my patient diabetes instead of their name after reading their medical history. My boss wasn’t amused but my coworkers were. No major consequences, just embarrassment.",
  "author": "MuttLoverMommy01",
  "score": 2786,
  "url": "https://reddit.com/r/tifu/comments/1q0q427/tifu_by_calling_a_patient_diabetes/",
  "created_utc": "2026-01-01 00:19:56",
  "num_comments": 153
}