{
  "id": "1q0vf1h",
  "subreddit": "relationships",
  "title": "Gf 26F lied that she had worked as a back page escort from me 24M for two years - I feel she’s not who I thought she was.",
  "body": "Gf 26F had told me that she needed money in the past, and sold NSWF pics, I asked if it went further and she said no. I 24M had no issue with this, as it was in the past, money is often tight so I saw this as a necessity of her survival. She said she did this when she was 19, and it was so long ago shes basically a new person; she never brought it up in a bragging way so I assumed she truly saw it as a form of survival. \n\nHowever last night on new years I meet her flatmate / friend, she asks if GF has told me what she did (in a joking way, both were drunk) \n\nIt turns out she had traveled to Aus from NZ with her friend, received 10k from one guy “just for a foot job” which she bragged about to the whole flat, even having her group chat nickname as “🦶💦”  \n\nI struggle to believe it was only that for such a large sum with travel, with a friend too. \nShe said she needed the money, but a friend laughed and said “you bought a switch and went on a cruise”\n\nIt’s not the act itself, it’s the lack of disclosure, the lack of transparency that I think still exists, the compartmentalization. I think she understands how it has created a problem, but doesn’t see that I feel I don’t know her, I feel like all her flatmates knew a secret I didn’t. Even her flatmate was upset with her when she found out she had hid it and changed the story from me. We had been talking about marriage 3 days ago, but I feel lost and numb. Has anyone got any recommendations on how to rebuild confidence after something like this, or advice on how to gain a sense of direction again? \n\nTLDR: gf 26F twisted a story about her past sex work, I 24M took it as a secret between us, she bragged about it to her flatmates who then revealed it was much more grand, changing my opinion of how she acts and who she is. She hides things from me, but bragged to flatmates. I feel lost, numb, and tired from it. Any advice on recovering from this is great, more so for myself. Thank you all. \n\n  EDIT: I GREW UP AROUND STRIPPERS AND ESCORTS, THIS IS NOTHING IM CONCERNED WITH NOR BODY COUNT, the issue is lying, compartmentalization, I feel like I’m dating someone with a double persona where everyone else knows her and I don’t. ",
  "author": "burneracc124367",
  "score": 128,
  "url": "https://reddit.com/r/relationships/comments/1q0vf1h/gf_26f_lied_that_she_had_worked_as_a_back_page/",
  "created_utc": "2026-01-01 05:13:59",
  "num_comments": 39
}