{
  "id": "1q0vofw",
  "subreddit": "relationships",
  "title": "Living with a spouse’s severe contamination OCD for 5 years. Looking for advice on partner burnout.",
  "body": "My wife (33F) has severe contamination OCD that began during COVID in 2020 when she was pregnant with our daughter. What started as understandable fear never resolved and has progressively worsened over five years. We have lived in our new home for three years, and OCD fully controls daily life inside it.\n\nIf we go out as a family and return home together, I am not allowed inside until she showers. I regularly sit in the garage for 2 to 2.5 hours while she and our daughter shower. Showering rituals are extensive, towels are avoided, and water drips through floors and closets. Door handles and cabinet finishes are damaged from constant wiping. Our daughter has never walked freely inside the house. Excessive wiping has also destroyed multiple phones over the past few years.\n\nOur marriage has been deeply affected. We argue frequently due to OCD-related rules and accommodations. For the past year and a half, we have slept in the living room, with me on one couch and my wife and daughter on another. Previously, entering the bedroom required 2 to 2.5 hours of showering first. Intimacy is essentially nonexistent.\n\nWe are also socially isolated. We have not had a guest in our home in over 2.5 years. In the past, when guests did visit, extensive cleaning afterward was required, leaving me physically exhausted. Groceries cannot enter the house directly and must be wiped or washed. I now do one large grocery run per month and clean everything myself while my wife goes to her mom’s house.\n\nOne of the hardest things for me to understand is that much of this does not happen at her parents’ house. When we stay with my in-laws, her symptoms are significantly reduced. Showering still occurs but lasts about 10 minutes instead of hours, with far fewer rules and much less distress. When we return home, it is like a switch flips.\n\n. I know she is suffering. But I am emotionally drained, burned out, and starting to lose interest in life. I do not feel relaxed or safe in my own home,\n\nTL;DR: My wife’s severe contamination OCD, triggered during the pandemic, now dictates every aspect of our lives. I spend hours waiting in the garage daily, our daughter is not allowed to walk freely in the house, and our home is being physically damaged by constant cleaning. While these behaviors vanish when we stay with in-laws, at home they are all-consuming. I am emotionally drained, our intimacy is gone.",
  "author": "Absoni2011",
  "score": 670,
  "url": "https://reddit.com/r/relationships/comments/1q0vofw/living_with_a_spouses_severe_contamination_ocd/",
  "created_utc": "2026-01-01 05:29:10",
  "num_comments": 77
}