{
  "id": "1q0yk82",
  "subreddit": "tifu",
  "title": "TIFU by accidentally making dessert chicken instead of fried chicken",
  "body": "So I recently got an awesome new deep fryer and was very excited to test out my skills. I decided to make fried chicken tenders and really do it right.\n\nI did all the prep, seasoned the batter, cut the chicken. I’m currently staying at my parents house for the holidays though, so I didn’t know where anything was. No big deal I figured flour is flour, right?\n\nI searched around the pantry, found something that looked like flour, and started coating the chicken. Immediately things felt… off. The coating was getting all gloopy and weird, and when I dropped the tenders into the fryer there was this strange solidified, granulated stuff forming in the oil. But I was already committed.\n\nMy parents came into the kitchen and told me I needed to dip the chicken in egg then flour, which explained why nothing was sticking properly. I was like ohhh okay that makes sense and kept going anyway.\n\nI ate the chicken. I was trying to make it spicy, but somehow it was not spicy at all instead it was weirdly sweet. Still kind of good not what I was going for, but edible. I just felt bad because I tried really hard and it wasn’t turning out right.\n\nFast forward a few hours later, my sister comes home. I overhear her ask my parents “Did they use powdered sugar instead of flour?”\n\nMy stomach dropped. I immediately knew. Nothing in the pantry was labeled, but still I absolutely should’ve noticed. I think I was just so excited about the chicken that my brain shut off completely.\n\nSo yeah I deep-fried chicken tenders in powdered sugar.\n\nI’m trying again tomorrow with actual flour. Hopefully this time I make food and not dessert.\n\nTLDR:  tried to make fried chicken at my parents house, couldn’t find flour, accidentally used powdered sugar, chicken was sweet, found out hours later I made candied chicken tenders.",
  "author": "goodsadboi",
  "score": 1223,
  "url": "https://reddit.com/r/tifu/comments/1q0yk82/tifu_by_accidentally_making_dessert_chicken/",
  "created_utc": "2026-01-01 08:29:22",
  "num_comments": 130
}