{
  "id": "1q10oab",
  "subreddit": "confession",
  "title": "My dad doesn’t know he’s not my dad…and never will",
  "body": "This is the 5th anniversary since I found out. \n(My dad is in his 60s me age 30)\nDuring the pandemic my bf and I thought I would be fun to do those ancestry dna test. Not thinking anything crazy would happen I was more concerned about my ethnicity not my family because I know my family….don’t i??? \nI get the test results email, log into the app and bam! A person I share the most dna with likely to be a PARENT I’m matched with… it’s a male and it’s NOT my dad I’ve known. \n\n\nMy mom and I are NOT close at all and she is the first person I reach out to but she was being a complete bitch about the situation, told me she had no clue who the guy was (I had already don’t my research) and she was absolutely no help. Of course she wouldn’t remember because she was sleeping around being young and dumb. \n\n\nI immediately took all personal identifying info off my ancestry profile so my cover wasn’t blown, made my family tree private. I dont want anyone to know…I reached out to the profile listed as parent but no reply, appears it was created by another family member on their behalf. \n\nAnyway I researched through the app family that had their tree available and came across what I believe to be my cousins page… stalked them on Instagram and I actually reached out…. He was shocked at who I was saying was matched to be my dad, asked me a TON of questions including asking me for baby pictures, the behavior got strange and turns out his dads name is the same name I matched with…\n\nHe tried to say the person who matched with me was his grandpa who is deceased but I believe it is actually HIS dad who the account belongs to (they have the same name) Because doing more digging the name of the person who manages the ancestry account I matched with, is his sister (would also be MY sister). \n\nI noticed not even two weeks after I reached out to him (my brother) I had a NEW match on ancestry with a “code” name not a real name to hide their identity of course… matched as a potential “sibling” lol cmon now. \n\nWhy would he be weird about it? Well that would mean his dad ( who is also my real dad) cheated on his mom with mine and got her pregnant. it doesn’t appear the two of them are still together. They all look like a great close big family. Educated, wealthy, and by the way he reacted I decided to just back off and leave it alone. I had to ask myself are you REALLY ready to open this up? \n\nThe man who raised me will always be MY DAD. I feel no different about his to be honest. I could never see myself letting this secret get out as I know it will hurt him more than anything. I will die with this secret and I’m okay with that. \n",
  "author": "Key-Accountant1098",
  "score": 906,
  "url": "https://reddit.com/r/confession/comments/1q10oab/my_dad_doesnt_know_hes_not_my_dadand_never_will/",
  "created_utc": "2026-01-01 10:52:15",
  "num_comments": 119
}