{
  "id": "1q10iel",
  "subreddit": "confession",
  "title": "I Rejected a Woman Because of Her Looks and Tried to Make It Up To Her 2Years Later Only For Her To Punish Me",
  "body": "So the story begins, I was in my living with my girlfriend in an apartment. We had a dysfunctional relationship by this time, mainly centered around her penchant for always getting in these fixes and needing a bail-out. The final straw was I suspected she was cheating on me (which proved to be true later).  One day she told me she was going to be gone for a week to visit her relatives in another state. I asked her if she would like me to come (she hadn’t offered), to which she said “No, I will be fine”. \n\nSo yeah, I was not liking this explanation and at the time I was already thinking of just exiting from the relationship due to the drama and trust issues. During her absence, I ended up talking to a woman on a local chat line for a few days and we agreed to meet for coffee snd and a movie date. Unusual for me, I did not ask for her picture prior to meeting (you can see where this is going). \n\nWhen we met we changed our plans and went straight to a movie. When I saw her first time she did not look anything like she described herself,for one,  she was carrying more weight than what I liked (my girlfriend at time was thin so I initially thought this was a step down) and was older in the face than what I expected. So yeah, no physical chemistry on my end. I am not saying I am anything great or even good, but  I like what I like. Still, for purposes of being respectful I stayed with the date, watched the movie with her, then she asked if we could go to the beach (this was night) and park the car. I felt obligated or just didn’t know what to do but we ended up at the beach. It was awkward because she got out came over and grabbed my hand we walked a bit down the beach and when we got back to the car she gets in the back seat and again, I have no explanation, but I complied and we just sit and talk, awkward, she is doing most the talking as I am feeling like zoned out being with someone I don’t connect with. I ended up cutting it short by saying it is late and I need to get home due to work next day. I drive her back to her car, give her a hug and thank her for the “date”. \n\nWhen I get home I felt literally sick to my stomach, first from guilt stepping out on my gf (even though she was awful to me), then second, realizing that all I have is her. After this experience I just stopped trying to meet someone better. The next couple days the woman I met left messages asking if I was ok, leaving impression she wanted to see me again, but like a jerk I never replied back. She stopped after 2 days. \n\nEventually, within a few months my gf ended up dumping me for another guy she met, which later I found out was someone she was already seeing for months behind my back. I took a breather after this and 2 years later I went into a store and was in an aisle and walked past this woman who said my name like she knew me, I turned around and at first didn’t recognize her, it was the same woman I went on the date with and rejected. Only she was thinner and changed her hair color to blonde. When I realized who she was I told her I was so sorry and wished that I realized I made a mistake because she was a nice person to me. She asked why didn’t I return my messages do I told her my situation at the time, but not telling her part of it was simply I wasn’t not feeling attracted to her. \n\nWe ended exchanging phone numbers, so a few days later I called and we talked and she asked if I would like to have dinner at her house. We met at her house, she cooked a nice dinner and we watched a movie, she showed me her house which was in state of being renovated. She knew I worked in construction and asked if I might be interested in helping her do repairs. \n\nSo for next 3 weeks I was working on the house every day, she would fix me dinner after which we would watch a movie or talk on the couch then I’d crash out on her spare bed, rinse and repeat,during this time we never did anything more than converse, I did make an attempt to hug her but she said “good night” as a way to end that gesture of affection. I ended up feeling rejected, just as she must have felt, because this clearly wasn’t going to go anywhere. I ended up coming to her house when she was at work, got my tools, and left her her house key. I called her and got a vm, to which I said I was sorry but this isn’t working out. She called me back and left me vm saying she didn’t understand, the house was coming along well. \n\nYeah it was just a weird situation, I felt like she had no intention of picking up where we left off, trying to date each other, instead lot felt like just she was taking revenge out having me work for free on her house.\n\nAddendum: Thanks for the kind understanding support, all 4 of you.",
  "author": "GullibleSection3482",
  "score": 182,
  "url": "https://reddit.com/r/confession/comments/1q10iel/i_rejected_a_woman_because_of_her_looks_and_tried/",
  "created_utc": "2026-01-01 10:40:57",
  "num_comments": 296
}