{
  "id": "1q101hh",
  "subreddit": "relationships",
  "title": "I don’t like how my bf treats my cat",
  "body": "Hi everyone,\nA bit of a ramble, but advice would be appreciated. \n\nMy boyfriend (30M) and I (25F) have been together for a little less than a year. So far he’s been an amazing partner. I love him and I do see a future together, but I can’t get over how he behaves around my cat. \n\nMy cat isn’t the cuddliest cat, is very particular about where he likes to be pet, and doesn’t like to be held. Basically, he likes to be around people, but doesn’t care for a lot of direct physical contact. He is more tolerant of me petting him because I’m his person. This doesn’t bother me, he’s incredibly sweet and he’s my little orange shadow.\n\nHowever, my boyfriend has little respect for my cat’s boundaries and I’m starting to get really frustrated. I’ve explained to him very clearly, on multiple occasions, that my cat doesn’t like to be held a lot and has his limits of where and how long he can be pet. My boyfriend ignores me, does all the things I tell him not to do, and then gets mad at my cat and calls him an asshole when my cat hisses or scratches him. He says things like he’ll “make my cat learn to like being held” and that “their relationship is like that”. When I tell him to cut it out, he also argues that other animals he’s interacted with aren’t like that, so my cat shouldn’t be. I’m of the opinion my boyfriend is being an asshole, and he needs to leave my cat alone because you can’t change a cat’s well established boundaries. \n\nI’m legitimately pissed off about this situation. He was antagonizing my cat again tonight and I kind of snapped and yelled at him to stop, but we didn’t really acknowledge it and he went to bed. I don’t want to go nuclear and break it off, but I’m not really sure how to approach the conversation because he hasn’t listened to me previously. Am I blowing things out of proportion seeing this as a major red flag and potentially a dealbreaker? How do I start a conversation about this without being accusatory, and make him understand I don’t see his actions as cute fun, but rather disrespectful? \n\nBefore anyone asks, we don’t live together and I’m not financially dependent on him in any way, so I’m not vulnerable in that regard. \n\nTL;DR: My boyfriend disrespects my cat’s boundaries and I’m not sure how to approach the situation. ",
  "author": "RecommendationNo5524",
  "score": 105,
  "url": "https://reddit.com/r/relationships/comments/1q101hh/i_dont_like_how_my_bf_treats_my_cat/",
  "created_utc": "2026-01-01 10:08:24",
  "num_comments": 61
}