{
  "id": "1q1emvw",
  "subreddit": "tifu",
  "title": "TIFU by broadcasting my \"pre-interview hype session\" to the interviewers for 3 minutes straight",
  "body": "Obligatory clarification: this didn’t happen today, but yesterday. I am posting this now because I’m still physically recoiling from the shame and need to vent.\n​I’ve been hunting for a new job for about three months now with zero luck. Finally, I landed an interview for a position I really, really wanted. It’s a remote role, so the interview was scheduled via Zoom.\n​I have this weird ritual I do before big calls to get my anxiety down. I pace around my room and hype myself up in the mirror. I’m talking full-on, aggressive. I scream things like \"YOU ARE A WEAPON. YOU EAT SPREADSHEETS FOR BREAKFAST. THEY ARE LUCKY TO EVEN SEE YOUR FACE.\" It works for me. Usually.\n​So, I join the Zoom meeting about 10 minutes early just to make sure my camera and lighting look good. It does. I see the standard \"Waiting for host to start the meeting\" screen, so I assume I'm safe.\n\n​Here is the massive FU.\n\n​I decided to run to the kitchen to grab a glass of water. I kept my wireless headset on so I could hear when they joined. But in my nervous state, I completely forgot that Zoom sometimes unmutes you automatically when the host joins if you don't change your settings.\n\n​I’m in the kitchen, pacing back and forth. The host (and the two other panel members) join the call. I don't hear them say \"Hello\" because I’m literally shouting at my fridge to pump myself up.\n​Here is a rough transcript of what they heard for about 45 seconds while looking at my empty chair:\n\"Let’s go baby! Who’s the man? You’re the man. Don’t sweat the gap in your resume, just lie! Gaslight them! You are a charming sociopath! LETS GOOOO!\"\n​I walked back into the room, sat down, and put on my best \"professional smile,\" ready to impress them.\n​All three interviewers were staring at me. Dead silence. One of them, the HR lady, was red in the face trying not to laugh. The hiring manager just looked absolutely terrified.\n​The HR lady finally unmuted and said, \"So... we definitely appreciate the... enthusiasm. But just so you know, we value honesty about resume gaps.\"\n​I wanted to close my laptop and move to a cave. I stammered through the rest of the interview, but I’m 100% sure I’m not getting the job.\n\n​TL;DR: I thought I was muted while waiting for a Zoom interview to start. I spent 5 minutes screaming at my fridge that I was a \"charming sociopath\" and planned to lie about my resume. The hiring panel heard the entire thing.",
  "author": "FrogStinky",
  "score": 300,
  "url": "https://reddit.com/r/tifu/comments/1q1emvw/tifu_by_broadcasting_my_preinterview_hype_session/",
  "created_utc": "2026-01-01 21:47:26",
  "num_comments": 15
}