{
  "id": "1q1gmvr",
  "subreddit": "confession",
  "title": "I started a rumor as a child that followed a woman into adulthood",
  "body": "I (31F) grew up in a small rural town in Wyoming. The town was fueled by gossip and beer as most small towns are which led to everyone knowing everyone’s business. In middle school, our class began testing the waters with bulling and overall nasty behavior and because I was an angsty theatre kid, girls would often try their hand at making me the butt of their jokes. Two girls in particular (sisters with similar ages to myself and my sisters can call her Ellie) began constantly making comments about me. How my hair looked, how I was poor and how I didn’t know my father. I would go home regularly and complain to Ellie (34) about this but her being a pretty, smart, and popular child she minimal empathy and told me to ignore it because those girls were X,Y,Z and beneath us. One day Ellie and I walked into school and were headed towards the common area, which is where all grades were supposed to wait until the first bell, we ran into the sisters. The girls said Hi (insert wildly specific insult incorporating my hair) and Ellie scoffed and called them some early 2000s insult. The older sister then stated at least her mother wasn’t and whore. Ellie told the sister it would hard to be a whore if you looked like an orangutan ( for context the girls were Italian and had dark thick arm and lower back hair) and we continued walking until the girls were out of ear shot. Once she was sure they couldn’t hear, Ellie casually stated the best form of revenge is sometimes revenge they never know is you. We decided we would begin telling people some stupid lie about their mother as it would only be appropriate to get back at them in the same manner. We would casually bring up in conversation the younger sister Brittany’s father was the mail man. We would add in that it was such a small issue because my sister and I had different dads or how we couldn’t believe people were being nasty about it because it’s not anyone’s business. We did this for a few weeks until we got bored of it and didn’t think about it again.\n\nAt least that is until a few months back when my partner and I were hanging out with a friend of his. This man happened to be the much older brother of those girls. We somehow got on the topic of his uncle and he mentioned how years ago when his sister was 12, his parents and uncle got into a mess with his sister’s paternity. Unbeknownst to Ellie and I, Brittany’s uncle was the town mailman. This rumor had left our little circle of gossipy kids and made its way to the town gossips. The town began to buzz with misinformation about her mother having an affair with her brother-in-law and how he fathered her child. This had gotten so out of hand the actual father wanted to get a paternity test. To this day, Ellie and I have told no one it was us. It’s been almost 20 years since we almost caused the separation of a family. ",
  "author": "Ravens-eye-51517",
  "score": 1165,
  "url": "https://reddit.com/r/confession/comments/1q1gmvr/i_started_a_rumor_as_a_child_that_followed_a/",
  "created_utc": "2026-01-01 23:08:23",
  "num_comments": 51
}