{
  "id": "1q1lvtx",
  "subreddit": "tifu",
  "title": "TIFU by thinking ice skating would be a fun romantic date",
  "body": "I (27f) had a great idea that my boyfriend (43m) and I should go into town today to go ice skating. I'm new to being a midwesterner and thought it would be romantic. I've grown up in Tennessee where you might have rinks in the city but other then that our winters weren't cold enough to get any real frozen surface to practice on. I did used to inline skate for a while as a kid so thought those skills would translate. I've seen cute movies about winters, and I figured that I'm in the Midwest now and need to adjust and try new things. And I've seen the movies. You know, where he holds me up while I stumble at first until I figure out I can skate flawlessly on my own and we sail around the rink under twinkle lights? It's the first day of 2026 and we should do something fun together to set the new year expectations. Romantic. Fun. Right? Wrong! \n\nHallmark you failed me! \n\n\n\nFor the first 20 minutes I flailed and tripped and scootched around on the little red walker thing that only other \\*literal children\\* were skating behind. My boyfriend being the one skating flawlessly around the rink btw. \n\n  \nI finally got confidence to pass the plastic walker to a 7 year old and kept on going. I actually went pretty far and then I went sailing... Right to the ground. Face first.\n\n  \nI don't remember exactly how my feet tripped me up but I just remember laying on the ground with my ears ringing, I couldn't see well and I couldn't get up by myself and it was just like everything was in slow motion. My boyfriend comes over and leads me to a seat and gets me some ice for my face. I couldn't think straight and just started mumbling that my entire left side of my face is numb from how I hit it.\n\n  \nCue me throwing up and my nose bleeding like crazy, he rushes me to the ER. They make me wait for what feels like forever, all I wanted to do is go to sleep and get rid of my headache but my boyfriend wouldn't let me go to sleep 😭 I totally understood why, even in the moment but it just felt so mean, and like. Personal. Lol. Before they could give me anything for the pain I got two CT scans to figure out that my face was now fractured in two different places 🫠 \n\n  \nHappy new year I guess, at least this is a way to make sure it'll be a bang up one for sure \n\n(For further context)\n\nThey gave me a shot of something that helped almost immediately after they told me about my fractures and I felt like a person again. Sent me home with some pain meds and am going to follow up with a plastic surgeon to take a look. I feel fine now, all is good. Ate a gummy and just thought it would be a good tifu\n\n  \nTL;DR: I thought it would be romantic to go ice skating with my boyfriend, ended up face planting on the ice, spent the rest of the day in the ER and was told I fractured at least two bones in my left cheek",
  "author": "iamthetrippytea",
  "score": 1078,
  "url": "https://reddit.com/r/tifu/comments/1q1lvtx/tifu_by_thinking_ice_skating_would_be_a_fun/",
  "created_utc": "2026-01-02 02:57:06",
  "num_comments": 284
}