{
  "id": "1q1qv37",
  "subreddit": "confession",
  "title": "I’ve (26M) been hooking up with my neighbor (58F) for the past 2 years.",
  "body": "Not much more to it.\n\nThe friends who know judge me for it. Some literally stopped wanting to be friends.\n\nMy family obviously doesn’t know but since I live at home still it’s kinda challenging.\n\nOne time I was coming back home at night and my mom asked why I’m coming from the neighbors house. I acted dumb and said I was coming back from my car that was parked by the street.\n\nIt’s double weird because my mom sort of knows the lady.\n\nWhy am I doing it? Idk girls my age seem to live in a different world. I don’t do “TikTok dances” or know the latest cultural things. Im way too busy with work to be in a serious relationship.\n\nThe sex is pretty awesome. Sometimes we go at it for hours. To my knowledge she is divorced. She has a son who is like 2 years younger than me but I’ve never actually met him. He’s away for college and lives far away.\n\nSometimes her and I joke that it would be so weird explaining things. But then again we are mostly doing it for the physical aspect and out of convenience for both of us. So it’s not a relationship.\n\nThe world is weird. Just thought to get it off my chest. I don’t believe in paying for sex and dating was too exhausting so this is kinda where I’m at right now. If anyone has questions I guess I can answer. Maybe this is more common than I realize and way less interesting to people. At least in my social circles I’m in a league of 1 and all my friends don’t really get it. Many of them act like they don’t see how a woman in her 50s can be attractive. Obviously I feel the opposite way.",
  "author": "justanotherday66",
  "score": 1919,
  "url": "https://reddit.com/r/confession/comments/1q1qv37/ive_26m_been_hooking_up_with_my_neighbor_58f_for/",
  "created_utc": "2026-01-02 07:01:29",
  "num_comments": 405
}